{"coordinates":"-23.701185,-46.7001484","detail_copy":"<p>Interlagos (or as it is officially known, Autódromo José Carlos Pace in memory of the Brazilian driver who perished in a 1977 plane crash) is among the most celebrated of all Formula One circuits. Known for its serpentine layout and dramatic elevation changes, the circuit has been the home of the Brazilian Grand Prix since 1973 but for the period from 1978-1989.</p> <p>Among a few major international circuits to run counter-clockwise, Interlagos was constructed between two reservoirs on the outskirts of Sao Paulo in the late 1930s, snaking around upon itself for 4.9 miles/7.96 km. A year after Argentina’s Carlos Reutemann won a non-championship Formula One race at Interlagos in 1972, the first true Brazilian Grand Prix produced a popular victory in Emerson Fittipaldi. Fittipaldi would win the race again the following year before Pace made it three straight for Brazil.</p> <p>However, the cost of maintenance and necessary safety upgrades led to the Brazilian Grand Prix moving to the comparatively antiseptic Jacarepaguá circuit near Rio de Janeiro. The event returned to Interlagos in 1990 following a $15 million revamp that saw the Grand Prix circuit shortened to 2.68 miles/4.292km, effectively by-passing two of the long track’s straightaways with a plunging downhill esse bend named in honor of Ayrton Senna.</p> <p>Many of the original corners were retained in the revised circuit including Ferradura (Horseshoe), Laranjinha (Little Orange), Pinheirinho (Little Pine Tree), Bico de Pato (Duck Bill), Mergulho (Dive) and the crucial Junção (Junction), which leads to the flat-out run through Subida dos Boxes (Up to the Pits) and Arquibancadas (Bleachers) curves to the Tribunas straightaway past the pits.</p> <p>Over the years, Interlagos has witnessed any number of memorable races, from the early wins by Fittipaldi and Pace, to Senna’s emotional victory in the 1991 Brazilian Grand Prix and a 2008 race that saw Lewis Hamilton edge Felipe Massa for the World Championship on the final lap of the season.</p> <p>In addition to Formula One, Interlagos has hosted international sports and touring car events along with a variety of national series including Stock Car Brazil, Formula Truck and Formula 3 as well as bicycle races, some of which utilize the Moto circuit, which features a chicane between Junção and Subida dos Boxes.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/autodromojosecarlospace","gallery_images":"1,2,3","gallery_prefix":"autodromojosecarlospace-gallery","large_image":"autodromojosecarlospace-large.jpg","logo":"/img/logos/tracks/autodromojosecarlospace-logo.png","north":"90deg","num_svg_images":9,"small_image":"autodromojosecarlospace-small.jpg","track_id":213,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_interlagos/213-interlagos-moto/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}