{"coordinates":"40.155193,-77.035617","detail_copy":"<p>Hearkening back to an era when America's dirt tracks were as much a part of county fairs and amusement parks as peanuts and cotton candy, Williams Grove Speedway is located in south central Pennsylvania adjacent to the amusement park established by the Williams family in the 1850s.  It was not until the late 1930s, however, that Emmett Shelley convinced the owners of Williams Grove Park to build a speedway across the street, a half mile dirt track that has since become inextricably woven into the DNA of American racing.</p><p>Williams Grove has hosted virtually every major national touring series on two and four wheels, from the American Automobile Association to the American Motorcyclist Association, the United States Auto Club and the National Association for Stock Car Racing to the World of Outlaws.  Equally, the roll call of Williams Grove winners begins with the legendary Tommy Hinnershitz (winner of the first race on May, 21, 1939) and encompasses names like Ted Horn, Gordon Johncock, Herb Thomas, Lynn Paxton, Jan Opperman, Steve Kinser and Sammy Swindell not to mention Keith Kauffman, Fred Rahmer, Lucas Wolfe, Lance Dewease, Donny Kreitz Jr. and other members of the 'Pennsylvania Posse'.</p><p>Likewise, Williams Grove has featured nearly every category of dirt car racing during its weekly schedule, from 'big cars' and jalopy and street stocks, midgets, Grand National stock cars and dirt Champ Cars to late models, super modifieds and, most notably, and sprint cars.  The track stages a World of Outlaws v Pennsylvania Posse competition for the Morgan Cup each spring while October brings the $50,000-to-win World of Outlaws National Open. </p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/williamsgrovespeedway","gallery_images":null,"gallery_prefix":null,"large_image":"williamsgrovespeedway-large.jpg","logo":"/img/logos/tracks/williamsgrovespeedway-logo.png","north":null,"num_svg_images":6,"small_image":"williamsgrovespeedway-small.jpg","track_id":274,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_williamsgrove/274-williamsgrove/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}