{"coordinates":"49.3300280,8.5708920","detail_copy":"<p>One of Europe's premier racing circuits, the heritage of the Hockenheimring takes back to 1932, when it was called \"Dreieckskurs\" (or \"triangle course\"). The track has undergone multiple redesigns since then, most recently in 2002, when a dramatically shortened new layout eliminated the long straightaways through the forest that produced exciting racing, but were taxing on engines and difficult for fans to see. Although the redesign was divisive among drivers and teams who welcomed the changes and those who missed the challenges of the old track, it kept the German Grand Prix at the track for 2002 and beyond.\r\n</p><p>The modern iteration of Hockenheim was designed by Hermann Tilke as one of his earliest major works. The full layout clocks in at just under three miles, with 17 turns that mix high-speed corners with tight and technical hairpins. Notable sections and corners include the Nordkurve, the fast right-hander that drivers see first after starting the race; the long, sweeping left-handed Parabolika that charges into the track’s tightest hairpin; and Sachs, another tight left-hander that makes up part of the stadium section in the latter stages of the lap. The Hockenheimring also features a number of shorter layouts for touring car and club racing, shortening the overall length to better suit these vehicles.\r\n</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/hockenheimringbadenwurttemberg","gallery_images":"1,2,3","gallery_prefix":"hockenheimringbadenwurttemberg-gallery","large_image":"hockenheimringbadenwurttemberg-large.jpg","logo":"/img/logos/tracks/hockenheimringbadenwurttemberg-logo.png","north":"90deg","num_svg_images":14,"small_image":"hockenheimringbadenwurttemberg-small.jpg","track_id":393,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_hockenheim/393-hockenheim-shorta/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}