{"coordinates":"41.4749519,-88.0594943","detail_copy":"<p>With the possible exception of New York City, no American market has been more coveted - or more underserved - by the auto racing industry than Chicago. After the Meadowdale International Raceway road course and its fiercesome \"Monza Wall\" closed in 1968, sanctioning bodies from CART and IMSA to Formula One attempted to organize auto races in, around and through the Windy City with little success. Even Chip Ganassi's Midas touch failed when his Chicago Motor Speedway ceased operations in 2002 after just four years of staging CART and NASCAR races.</p> <p>Of course, one major factor contributing to the demise of CMS was the opening of a competing facility in nearby Joliet by the name of Chicagoland Speedway. Built at a cost of $130 million and backed by a virtual Who's Who of American auto racing, Chicagoland Speedway is a world class motor sports complex featuring a 1.5 mile superspeedway together with a state-of-the-art drag strip at the adjacent Route 66 Raceway. Who's Who? Try Tony George and the late Bill France, Jr., together with a collection of Chicago-area entrepreneurs including IndyCar Series team owner Dale Coyne.</p> <p>Although it's tempting to lump the 1.5 mile oval with the bevy of so-called \"intermediate\" ovals that rose across the country in the 1990s and early years of the 21st century, Chicagoland's layout is unique. It's an oval that never truly straightens out thanks to a couple of kinks on the frontstretch and a backstretch that is one long, continuous curve. As a result, Chicagoland poses unique challenges, not just to those who drive it but to the engineers and mechanics who must fine-tune their cars to the track's singular character.</p> <p>Since opening for business in 2001, Chicagoland has established a rich history in its first decade of operation, particularly in IndyCar competition. In a series renowned for its photo finishes, the IndyCar Series has produced the two closest finishes in series history at Chicagoland, with Sam Hornish, Jr. beating Al Unser, Jr. by .0024s in 2002 and Helio Castroneves pipping Scott Dixon by .033s in the 2008 season finale. Of course, neither Dario Franchitti nor Scott Dixon will soon forget the 2007 contest that saw the Scotsman win the race - and the IndyCar Series title - when \"Dixie\" ran out of fuel half a lap from the finish.</p> <p>Chicagoland is no less competitive when the race cars sport fenders. In fact, Kyle Busch is the only driver to win a NASCAR Sprint Cup Series&#8482; race at Chicagoland from the pole and only one other driver - Kevin Harvick - has qualified in the top ten and won. Harvick also has the distinction of coming from the deepest in the field (32nd) to win at Chicagoland, while Dale Earnhardt, Jr. (25th) and Tony Stewart (19th) also emerged victorious after starting deep in the pack.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/chicagolandspeedway","gallery_images":"1,2,3,4,5,6,7,8,9","gallery_prefix":"chicagolandspeedway-gallery","large_image":"chicagolandspeedway-large.jpg","logo":"/img/logos/tracks/chicagolandspeedway-logo.png","north":"90deg","num_svg_images":7,"small_image":"chicagolandspeedway-small.jpg","track_id":123,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_chicagoland/123-chicagoland/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}