{"coordinates":"47.9560052,0.2056765","detail_copy":"<p>Home of the legendary 24 Hours of Le Mans, the Circuit de la Sarthe is hallowed ground in the world of motor racing.  Along with the Indianapolis Motor Speedway (constructed in 1909), the Circuit de la Sarthe is one of the oldest active racing facilities, having first hosted the 24 Hours of Le Mans in 1923.</p><p>Composed entirely of public roads near the French city of Le Mans, the Circuit de la Sarthe of the 1920s was 10.7 miles (17.2 km) long.  A triangular loop that ran into Le Mans itself was eliminated in 1932 by a bypass that reduced the track to 8.3 miles (13.4 km) in length and formed the basis for the track's modern 8.4 miles (13.6 km) configuration.</p><p>Although the Circuit de la Sarthe still incorporates public roads, the track has been modified over the years in the interests of safety, never moreso than when the pit straightaway was widened following a horrific accident in 1955 that claimed the lives of 83 people.  Subsequently, a purpose-built section of high speed curves (Porsche Curves) and increasingly tight chicanes (Ford Chicanes) was created during the early 1970s to slow cars as they approached the pits.  In 1987 another chicane was added on the approach to the first turn (Dunlop Curve) and, three years later, a pair of medium speed chicanes were added to what was once the 3.7 mile long Mulsanne Straightaway.</p><p>Evolutionary changes notwithstanding, the essential nature Circuit de la Sarthe remains unchanged: it is a supreme test of race cars and race drivers, with long straights where low drag is paramount, the superfast Porsche Curves which place a premium on downforce, highly technical, twisty chicanes and tight corners at the end of high speed sections to test a car's brakes . . . and a driver's ability to use them.</p><p>In its glorious history, the Circuit de la Sarthe has witnessed countless epic battles among legendary drivers with names like Nuvolari, Fangio, Moss, Gendebien, Hill, Amon, McLaren, Gurney, Foyt, Pescarolo, Ickx, Bell, McNish and Kristensen and the world's leading automakers from the Bentleys of the 1920s to the streamlined Bugattis and Alfa Romeos of the '30s.  Following World War II, Mercedes-Benz, Jaguar, Aston Martin and Ferrari waged titanic battles at Le Mans, before the epic Ford v Ferrari showdowns of the mid-'60s and the Porsche v Ferrari classics of the '70s featuring the fearsomely iconic Porsche 917s and Ferrari 512s.</p><p>After Porsche emerged as the dominant marque in the '80s and '90s, Audi ruled the Circuit de la Sarthe (first with its turbocharged V8 Audi R8 and, later, turbo diesel R10 TDI) for the first decade of the 21st century (notwithstanding Peugeot's win in '09).  Of late, Le Mans has seen fantastically complex hybrid prototypes from Audi, Porsche and Toyota battle for the overall win while other marques including Aston Martin, Chevrolet (Corvette), Ferrari, Porsche, BMW and Ford have battled for GT honors around a circuit whose landmarks like the Dunlop Bridge and the Tertre Rouge, Mulsanne, Indianapolis and Arnage turns stir the souls of motor racing fans around the world. Home of the legendary 24 Hours of Le Mans, the Circuit de la Sarthe is hallowed ground in the world of motor racing.  Along with the Indianapolis Motor Speedway (constructed in 1909), the Circuit de la Sarthe is one of the oldest active racing facilities, having first hosted the 24 Hours of Le Mans in 1923.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/circuitdes24heuresdumans","gallery_images":null,"gallery_prefix":null,"large_image":"circuitdes24heuresdumans-large.jpg","logo":"/img/logos/tracks/circuitdes24heuresdumans-logo.png","north":null,"num_svg_images":14,"small_image":"circuitdes24heuresdumans-small.jpg","track_id":269,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_lemans/269-lemans-nochicane/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}