{"coordinates":"43.0204523,-88.0150972","detail_copy":"<p>The oldest continuously operating motorsport facility in the world, the Milwaukee Mile has more than a century's worth of history. While the track honors its history each year with the <em>Millers at Milwaukee Vintage Indy Car Event</em>, it's the current-day challenge of getting a racing car around Milwaukee's barely banked corners that makes every race day at this Midwestern fairground oval another page in the history book.</p> <p>From its opening in 1905 the Mile has been home to open-wheel racing cars - for the first 49 years as a dirt track and since 1954 as a paved one. For more than 60 years Milwaukee has been the next stop on the IndyCar circuit following the Indy 500, where drivers who had bad race at Indy got another shot at glory.</p> <p>In addition to IndyCars, the track has hosted a number of other open-wheel classes, including the developmental Indy Pro Series, USAC's front-engine Silver Crown cars - the direct descendants of the cars that raced here more than a century ago - and Midgets. Stock cars have been racing regularly at Milwaukee since 1950, and in addition to the NASCAR Nationwide Series&#8482;, NASCAR Craftsman Truck Series&#8482;, ARCA's RE/Max series, the ASA Late Model Series, Milwaukee is host to the Mid-American Stock Car Series. It's not unheard of to see a NASCAR Sprint Cup Series&#8482; team testing at Milwaukee in preparation for a race at one of the short, flat ovals on that circuit.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/themilwaukeemile","gallery_images":"1,2,3,4,5,6,7,8,9,10,11,12","gallery_prefix":"themilwaukeemile-gallery","large_image":"themilwaukeemile-large.jpg","logo":"/img/logos/tracks/themilwaukeemile-logo.png","north":"90deg","num_svg_images":10,"small_image":"themilwaukeemile-small.jpg","track_id":94,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_milwaukee/94-milwaukee/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}