{"coordinates":"43.36268,-71.462767","detail_copy":"<p>Major league auto racing arrived in New England in style when New Hampshire Motor Speedway opened its gates in the summer of 1990. The first superspeedway constructed in the United States in twenty years, NHMS heralded the start of a construction frenzy that would see more than a dozen new speedways built around the country by the close of the decade. Many of the new tracks would be faster, some more ostentatious, but none placed a premium on car and driver like NHMS.</p> <p>Just over a mile in length, NHMS' oval is a classic \"paper-clip\" design with long straightaways and tight, flat turns. Not surprisingly, the track rewards cars that have plenty of \"grunt\" off the corners and brakes capable of getting things slowed-down at the end of the front straightaway and the backstretch... not to mention drivers who can baby those brakes from start to finish in races lasting three hours or more while making their cars work high and low in the turns.</p> <p>Speaking of more, there's more to NHMS than the one mile oval. In keeping with a heritage dating back to 1965 when the site was home to twisty Bryar Motorsports Park, NHMS offers top-flight road racing. Although the configurations incorporate different portions of the oval and twisting infield roads, they all utilize a breathtaking loop that climbs into the countryside beyond the backstretch to a 180 degree bowl of a turn before plunging back down to the oval.</p> <p>With an oval hosting a full slate of NASCAR competition including NASCAR Sprint Cup Series&#8482;, NASCAR Nationwide Series&#8482;, NASCAR Camping World Truck Series&#8482;, Nascar Camping World East Series&#8482; and Nascar Whelen Modifieds Series&#8482;, road courses that are home to a variety of SCCA and vintage sports car events as well as motorcycle races and permanent seating for more than 105,000 spectators, it's no wonder NHMS is the undisputed home of motorsports in New England. Nor was it any wonder when founders Bob and Gary Bahre decided to sell the facility in 2008 that Bruton Smith and Speedway Motorsports Inc. were happy to make them an offer they couldn't refuse.</p> <p>Speaking of more, there's more to NHMS than a one mile oval. The facility features the new 0.25-mile Granite State Legends Cars Mini-Oval and, in keeping with a heritage dating back to 1965 when the site was home to twisty Bryar Motorsports Park, NMHS offers top-flight road racing as well. Although the configurations incorporate different portions of the big oval and twisting infield roads, they all utilize a breathtaking loop that climbs into the countryside beyond the backstretch to a 180 degree bowl of a turn before plunging back down to the oval.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/newhampshiremotorspeedway","gallery_images":"1,2,3","gallery_prefix":"newhampshiremotorspeedway-gallery","large_image":"newhampshiremotorspeedway-large.jpg","logo":"/img/logos/tracks/newhampshiremotorspeedway-logo.png","north":"90deg","num_svg_images":6,"small_image":"newhampshiremotorspeedway-small.jpg","track_id":129,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_newhampshire/129-newhampshire-chicane/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}