{"coordinates":"38.1608659,-122.4568882","detail_copy":"<p>Nestled in the Sonoma Mountains near a geographic formation known as Sears Point, Sonoma Raceway is one of several road-racing venues on the NASCAR schedule. Sonoma Raceway presents a unique challenge for drivers of big stock cars. While the 1.99-mile, 10-turn stock car configuration cuts off two slow turns and a half mile of pavement, there are still plenty of ups and downs and zigs and zags for the NASCAR Cup and NASCAR Truck drivers to cope with. Keeping the tires and brakes in good working order while maintaining a competitive pace is one of the bigger challenges these drivers face all year.</p> <p>Most other road-racing classes that compete at Sonoma, including the Grand-Am Rolex Sports Car Series™, SCCA National and Regional, NASA and vintage use the full 2.52-mile, 12-turn circuit, while the IRL Indy cars and AMA motorcycle events use a modified 2.22 mile (3.57 km), 12 turn course. This layout, opened in 2003, skips much of the Esses and run from Turn 10 to Turn 11 (the hairpin) for additional safety for motorcyclists, including runoff available in the motorcycle Turn 11 (the main Turn 11 has no runoff, and is a very slow turn, similar to the Loews hairpin at Monaco).</p> <p>Until it was taken over by Speedway Motorsports in 1996, the facility endured a turbulent history under a variety or names and owners (one of which was a Hollywood studio!) While the circuit opened for competition in 1968 under the name Sears Point Raceway and hosted , USAC Indy car, NASCAR West stock car, SCCA professional and amateur and AMA motorcycle races, it failed to perform financially and was closed down two years later. In 1973 the track reopened as a venue for amateur sports car competition and - on a separate drag strip - drag racing, but it wasn't until 1989 and the arrival of NASCAR's top series that the track's prospects truly began to brighten. A $60 million improvement program, begun in 2000, has catapulted Sonoma Raceway into the top rank of American motorsport facilities.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/sonomaraceway","gallery_images":"1,2,3","gallery_prefix":"sonomaraceway-gallery","large_image":"sonomaraceway-large.jpg","logo":"/img/logos/tracks/sonomaraceway-logo.png","north":"90deg","num_svg_images":10,"small_image":"sonomaraceway-small.jpg","track_id":48,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_sonoma/48-sonoma-cup/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}