{"coordinates":"50.3334443,6.9392429","detail_copy":"<p>One of motorsport's most iconic venues, Germany's Nürburging features the best of both worlds: a classic, old-school circuit that demands the best of both car and driver, and a modern layout built for the demands of current machinery. For select events, like the 24 Hours of the Nürburgring, these layouts are combined to create an even more unique challenge.</p> \n<p>Widely considered to be the world's most demanding road course, the Nordschleife twists and turns, rises and falls for 12.9 miles through Germany's Eifel Mountains. The ‘Ring boasts an elevation gain/loss of nearly 1,000 feet per lap and many of its 73 bends like the Hatzenbach, Adenauer Forst, Wehrseifen, the Karussell, Pflanzgarten and Schwalbenschwanz are steeped in motorsports lore.</p>\n<p>Constructed between 1925-27, the Nürburgring originally consisted of two circuits – the 14.1-mile Nordschleife and a companion 4.8-mile Südschleife which were occasionally combined to form a mammoth, 17.6 mile Gesamtstrecke. The Nordschleife, however, was the centerpiece of the facility and hosted the German Grand Prix Formula One and 1000K sports car races through the 1970s when major safety renovations were implemented. But the 1976 German Grand Prix saw world champion Niki Lauda nearly perish in a fiery accident and the race was subsequently moved to Hockenheim.</p>\n<p>However, the German Grand Prix returned to the Nürburgring after the Nordschleife's start/finish area and much of the Südschleife were demolished to create a modern circuit – the 3.2-mile Grand-Prix-Strecke in 1982-83. Originally a 12-turn, 4.556-km (2.832-mile) circuit, the GP-Strecke was revamped in 2002 with the replacement of the Castrol Chicane by the Haug-Hook right hander and subsequent omega-shaped Mercedes Arena turn, bringing the circuit to its current 16-turn, 5.148-km (3.199-mile) specification. Along with the parabolic Dunlop-Kehre, the track's signature section is the Michael Schumacher S formed by Turns 9-10.</p>\n<p>The GP-Strecke was the home of the German Grand Prix and/or the European Grand Prix between 1984 and 2006 and, subsequently, alternated with Hockenheim as site of the German GP until the race was dropped from the F1 calendar altogether in 2015. When not in combined use, the GP-Strecke continues to host rounds of the German Touring Car Championship and GT World Challenge, while the Nordschleife is still used for testing and club races and is open to the public for lapping days otherwise.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/nurburgring","gallery_images":null,"gallery_prefix":null,"large_image":"nurburgringcombined-large.jpg","logo":"/img/logos/tracks/nurburgring-logo.png","north":null,"num_svg_images":23,"small_image":"nurburgringcombined-small.jpg","track_id":262,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_nurburgring_combined/262-nurburgring-combinedshortb/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}