{"coordinates":"36.531954,140.2232026","detail_copy":"<p>Dario Franchitti once observed that his first view of Twin Ring Motegi made him feel like he was ìin a James Bond movie.î Understandably so. Said to be the largest construction project on the Pacific Rim when it was begun in 1996 under the auspices of the Honda Motor Company, the combination oval/road course sits in a bowl that was created by lopping-off the tops of several mountains 90 mile northwest of Tokyo.</p> <p>The resulting facility features an egg-shaped oval and a completely separate road course with three different configurations, with two complete pit and paddock complexes. And thatís just for openers. Twin Ring Motegi is also home to the Honda Collection Hall, a stunning exhibit of Honda racing and production cars and motorcycles, as well as the Honda Fan Fun Lab which features a preview of Hondaís next generation technologies. And overlooking Turns 3 and 4 of the oval is a four star hotel and restaurant.</p> <p>Twin Ring Motegiís 1.549 mile oval is a unique, egg-shaped configuration. Turns One and Two are wide and fast, while Turns Three and Four feature a tighter radius and usually require a downshift (or two) to negotiate at maximum speed.</p> <p>The three road courses include the West, East and GP. The .869 mile West course is contained within the oval and consists of six turns. The 2.983, 14 turn mile international course utilizes much of the West course before passing under the ovalís back straightaway and winding through the surrounding countryside before a tight hairpin and return straightaway (with a separate pit facility) brings it through a second tunnel and back inside the speedway. The 2.112 East course uses much of the GP, but only a small portion of the West course.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/motegi","gallery_images":"1,2,3","gallery_prefix":null,"large_image":"motegi-large.jpg","logo":"/img/logos/tracks/motegi-logo.png","north":"90deg","num_svg_images":11,"small_image":"motegi-small.jpg","track_id":198,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_twinring/198-twinring-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}