{"coordinates":"52.0733006,-1.0168574","detail_copy":"<p>Get on track with the newest configuration of the “Home of British Motor Racing.” Silverstone Circuit’s current layout is one of the longest in its storied history, which includes the first-ever race of the Formula One World Driver’s Championship in 1950. Two years later, Frolian Gonzales gave Ferrari its first-ever F1 victory there, and the rest is history: in the nearly seven decades that have followed, the former World War II air base has become one of the world’s legendary motorsport venues.</p><p>Located in the English midlands, northwest of London and in the middle of the British motorsports industry, the facility that each year hosts the British Grand Prix bears scant resemblance to the original circuit that was made up of linked runways. Silverstone is host each year to a myriad of road racing classes, ranging from Formula One to Formula Ford in the open-wheel category, and numerous sports and GT series including the European Le Mans Series, British GT Championship, touring car and club racing.</p><p>Though the facility has little in the way of elevation changes as a former air base, for much of its history Silverstone was known for its ultra-fast sweeping corners and fast average speeds. Though the requirements of modern Formula One forced the addition of chicanes and other devices to slow speeds down from the insane to the merely ridiculous, the track retains many of the characteristics that originally made it famous.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/silverstone","gallery_images":null,"gallery_prefix":null,"large_image":"silverstone-large.jpg","logo":"/img/logos/tracks/silverstone-logo.png","north":null,"num_svg_images":5,"small_image":"silverstone-small.jpg","track_id":341,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_silverstone_2019/341-silverstone-2019-gp/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}