{"coordinates":"33.5669742,-86.0683193","detail_copy":"<p>Talladega Superspeedway lives up to its name - of all the closed-circuit motorsports facilities in the world where sanctioned auto races are held, it is the fastest. Constructed by the France family's International Speedway Corporation ten years after Daytona International Speedway, Talladega was built slightly longer at 2.66 miles and with steeper 33-degree banking which guaranteed record-setting speeds. The pole speed for NASCAR's first race in 1969 was a stunning 199.466 mph, almost 30 mph faster than the IndyCars were then lapping at Indianapolis Motor Speedway.</p> <p>In 1975 Mark Donohue set the world record for speed on a closed course by driving a Porsche 917-30 around Talladega Superspeedway at 221.160 mph. Donohue's world record stood for four years before finally being broken at Italy's 7.5-mile Nardo high-speed test facility.</p> <p>Rule changes in 1987 mean Bill Elliott's 212.809 mph lap will stand forever as the qualifying record at Talladega and for NASCAR. Talladega Superspeedway is still the fastest track on the schedule - it holds the record for the fastest 500-mile stock car race at 188.354 mph; Mark Martin's winning speed in May, 1997 - and produces some of the most exciting fender-to-fender racing every year.</p> <p>Talladega holds the record for most leaders in a 500-mile race (26) and most lead changes as well (75 at the start/finish line), but on the last lap, don't ever bet against a driver named Earnhardt. Dale Sr. racked up an amazing ten NASCAR Sprint Cup Series™ race wins, and Dale Jr. already has five on his resume, including a remarkable four-in-a-row streak in 2002-3.</p> <p>Talladega Superspeedway presents five separate racing shows each year as host to the NASCARs top three series,  and the Automobile Racing Club of America (ARCA). Competing in high-speed packs at Talladega should prove both challenging and exciting for iRacers as well.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/talladegasuperspeedway","gallery_images":"1,2,3","gallery_prefix":null,"large_image":"talladegasuperspeedway-large.jpg","logo":"/img/logos/tracks/talladegasuperspeedway-logo.png","north":"90deg","num_svg_images":11,"small_image":"talladegasuperspeedway-small.jpg","track_id":116,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_talladega/116-talladega/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}