{"coordinates":"-34.006111,150.733889","detail_copy":"<p>One of Australia's most historic race tracks, Oran Park lives forever on iRacing.com even though it fell to the wreckers' ball and bulldozers in 2010 to make way for a housing development. Shortly before this unique track went the way of Riverside Raceway and Trenton Speedway, iRacing's laser-scanning crew mapped Oran Park's different configurations, thus insuring the beloved suburban Sydney circuit will be available in digital form for future generations.</p> <p>The \"original\" Oran Park staged its first race on a one mile circuit in 1962, and the track was subsequently expanded to 1.2 miles. 1974 saw the track expanded further, to 1.6 miles with the incorporation of a loop and cross-over bridge, resulting in one of the world's few \"figure-eight\" style circuits.</p> <p>Over the years Oran Park became a fixture on the Australian Touring Car Championship and V8 Supercar Series presented by Big Pond. Fittingly, Australian legends Allan Moffat and Mark Skaife share the record of six wins apiece at the track. Oran Park also hosted a couple of rounds of the Superbike World Championship in 1988 and '89, as well as a number of touring car endurance races. Garth Tander won the final V8 Supercar race at Oran Park in 2008.</p> <p>iRacing's version of Oran Park features three different configurations including the 1.6 mile (2.6 km) Grand Prix Circuit, the 1.2 mile (1.9 km) South Circuit. the .4 mile (.6 km) North Circuit, which is an almost perfect figure-eight shape.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/oranparkraceway","gallery_images":"1,2,3","gallery_prefix":"oranparkraceway-gallery","large_image":"oranparkraceway-large.jpg","logo":"/img/logos/tracks/oranparkraceway-logo.png","north":"90deg","num_svg_images":9,"small_image":"oranparkraceway-small.jpg","track_id":207,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_oran/207-oran-north/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}