{"coordinates":"39.1899138,-75.5328525","detail_copy":"<p>They don't call it the Monster Mile for nothing. And it's not just because there's a 46 foot tall, muscle-bound, statue outside the gates named \"Miles the Monster.\"</p>\r\n<p>No, Dover Motor Speedway is a real monster of a race track. Exactly one mile in length, Dover has some of the most extreme banking (24 degrees) on the NASCAR Sprint Cup Series&#8482; circuit. Even the straights are banked at nine degrees. Did we mention Dover is one of only two Sprint Cup tracks (along with Bristol Motor Speedway) that features concrete pavement the whole way 'round?</p>\r\n<p>Dover is also unique in that the track is part of a larger sports and entertainment complex that includes a hotel, gaming casino and harness racing track. But it's the mechanical ponies - as in the 750  horsepower NASCAR Sprint Cup Series&#8482; machines and their sibling NASCAR Nationwide Series&#8482; and NASCAR Camping World Truck Series&#8482; racers - that grab the motorsports fans' attention twice a year. Up to 140,000 people from the Mid-Atlantic and beyond flock to the track for two big NASCAR weekends in the Spring and Fall.</p>\r\n<p>Constructed between 1967 and '69, Dover Motor Speedway was initially paved with asphalt. It wasn't until 1995's comprehensive revamp that the track was paved in concrete, giving Dover's racing surface its distinctive white appearance - albeit with many of shades of gray and black after a weekend's worth of rubber is laid down! No matter the pavement, Dover has long been one of the most competitive tracks on the NASCAR schedule. From 1969 through '80, 21 of the 22 Cup races at Dover Motor Speedway were won by drivers who either already had or would go on to win championships in NASCAR's top series.</p>\r\n<p>The names of those winners are part of the fabric of the sport - Richard Petty, Bobby Allison, David Pearson, Cale Yarborough, Benny Parsons and Darrell Waltrip. Allison and Petty rank first on the all-time winner's list at Dover Motor Speedway with seven victories apiece. More recently, Jimmie Johnson (six), Jeff Gordon (four), Mark Martin (four) and a host of other stock car legends have added their names to the list of Dover Motor Speedway's winners, a list that also includes Scott Sharp and Greg Ray, who each won a race during Dover's cameo appearance on the Indy Racing League calendar in the late 1990s.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/doverinternationalspeedway","gallery_images":"1,2,3","gallery_prefix":"doverinternationalspeedway-gallery","large_image":"doverinternationalspeedway-large.jpg","logo":"/img/logos/tracks/doverinternationalspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"doverinternationalspeedway-small.jpg","track_id":162,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_dover/162-dover/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}