{"coordinates":"44.1540543,-70.4865637","detail_copy":"<p>Maine is the northeastern-most state of the United States, and the 14,000-seat Oxford Plains Speedway is the biggest public facility in the Pine Tree State. OPS opened in 1950 as a half-mile dirt track with shallow-banked turns. Carved out of 200 acres of woodland in six short weeks, the facility featured a wooden grandstand that seated 5,000 spectators and parking for 1,000 cars.</p> <p>In 1961 the track was revamped as a one-third-mile paved oval with wide-open turns. Three years later Maine businessman Bob Bahre purchased the track and began a program of improvements to the facility that included a modern large-capacity grandstand. With the widening of the backstretch during a 1992 repaving, the track assumed its current 3/8ths-mile configuration.</p> <p>During the 1960s Oxford Plains Speedway hosted NASCAR Sprint Cup Series&#8482; races, and in 1966 Bobby Allison won his first victory on NASCAR's senior circuit at OPS. Today Late Models are the featured class and the track is home to the annual TD Banknorth 250, the richest one-day Late Model race meet in America. In 2007 156 cars entered the event, with 92 of them taking part in time trials. Over the years Allison's son Davey, Jeff and Ward Burton, Kurt and Kyle Busch, Jeff Gordon, Dale Jarrett, Matt Kenseth, Bobby and Terry Labonte, Mark Martin, and Rusty Wallace are among the NASCAR stars who have competed in this historic Late-Model event.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/oxfordplainsspeedway","gallery_images":"1,2,3","gallery_prefix":"oxfordplainsspeedway-gallery","large_image":"oxfordplainsspeedway-large.jpg","logo":"/img/logos/tracks/oxfordplainsspeedway-logo.png","north":"90deg","num_svg_images":9,"small_image":"oxfordplainsspeedway-small.jpg","track_id":12,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_oxford/12-oxford-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}