{"coordinates":"52.0733006,-1.0168574","detail_copy":"<p>In 1950, its third year of operation, Silverstone was the site of the very first World Championship Formula One race, won by Giuseppe Farina in an Alfa-Romeo. Two years later Froilan Gonzales gave Ferrari its first-ever World Championship grand prix victory there. And the rest is history - in the nearly six decades that have followed, the former World War II air base has become one of the world's legendary motorsport venues. Located in the English midlands, northwest of London and in the middle of the British motorsports industry, the facility that each year hosts the British Grand Prix bears scant resemblance to the original circuit that was made up of linked runways.</p> <p>With five different circuit configurations, including the National (1.64 miles), International (2.25 miles), Southern (1.97 miles), Historic Grand Prix (3.14 miles) and Grand Prix (3.20 miles), Silverstone is host each year to a myriad of road-racing classes, ranging from Formula One to Formula Ford in the open-wheel category and numerous sports and GT series including the Le Mans Series, British GT Championship, FIA GT and club racing.</p> <p>Though as a former air base, the facility has little in the way of elevation changes, for much of its history Silverstone was known for its ultra-fast sweeping corners and fast average speeds. Though the requirements of modern Formula One forced the addition of chicanes and other devices to slow speeds down from the insane to the merely ridiculous, the Historic Grand Prix course retains the open, flat-out corners that originally made the track famous.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/silverstonecircuit","gallery_images":"1,2,3","gallery_prefix":"silverstonecircuit-gallery","large_image":"silverstonecircuit-large.jpg","logo":"/img/logos/tracks/silverstonecircuit-logo.png","north":"90deg","num_svg_images":9,"small_image":"silverstonecircuit-small.jpg","track_id":44,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_silverstone/44-silverstone-national/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}