{"coordinates":"50.3334443,6.9392429","detail_copy":"<p>Widely considered to be the world's most demanding road course, the Nürburging's Nordschleife twists and turns, rises and falls for 12.9 miles through Germany's Eifel Mountains. The 'Ring boasts an elevation gain/loss of nearly 1,000 feet per lap and many of its 73 bends like the Hatzenbach, Adenauer Forst, Wehrseifen, the Karussell, Pflanzgarten and Schwalbenschwanz are steeped in motorsports lore.</p>\n<p>Constructed between 1925-27, the Nürburgring originally consisted of two circuits - the 14.1-mile Nordschleife and a companion 4.8-mile Südschleife which were occasionally combined to form a mammoth, 17.6-mile Gesamtstrecke. The Nordschleife, however, was the centerpiece of the facility and hosted the German Grand Prix Formula One and 1000K sports car races through the 1970s when major safety renovations were implemented. But the 1976 German Grand Prix saw world champion Niki Lauda nearly perish in a fiery accident and the race was subsequently moved to Hockenheim.</p>\n<p>However, the German Grand Prix returned to the Nürburgring after the Nordschleife's start/finish area and much of the Südschleife were demolished to create a modern circuit - the 3.2-mile Grand-Prix-Strecke in 1982-83. While the modern circuit played host to the German Grand Prix (and occasionally the European Grand Prix) from 1984-2014), the German Touring Car Championship and other events, the Nordschleife (shortened to 12.9 miles to make way for the GP-Strecke) is still used for testing and club races and, in combination with the GP-Strecke, the 24 Hours of the Nürburgring. When not in use for races and testing, the Nordschleife is open to the public for lapping days.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/nurburgring","gallery_images":null,"gallery_prefix":"nurburgring-gallery","large_image":"nurburgringnordschleife-large.jpg","logo":"/img/logos/tracks/nurburgring-logo.png","north":"90deg","num_svg_images":11,"small_image":"nurburgringnordschleife-small.jpg","track_id":249,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_nurburgring_nordschleife/249-nurburgring-nordschleife/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}