{"coordinates":"34.2973206,-79.9073456","detail_copy":"<p>\"The Lady in Black,\" \"The Track That's Too Tough To Tame\"; those are two of the names, the polite ones anyway, that drivers and fans have given Darlington Raceway over the years. The oldest speedway on the NASCAR circuit, Darlington Raceway's egg-shaped configuration - one end is big and wide-open while the other is pinched tight - has been perplexing racing drivers and mechanics since it opened in 1950 with the inaugural running of the Southern 500 NASCAR stock car race. The track was built on an old farm in the middle of rural South Carolina, and its unique shape is the legacy of a minnow pond that the farmer who owned the land wasn't willing to give up. Minnows still swim in that pond six decades later, and while lap speeds have risen to nearly 180 mph, a car set up just right for one end of the 1.366-mile oval still won't handle on the other one. The fastest lap times are achieved with a compromise - the car isn't perfect at either end of the track, but a really talented driver can coax the car quickly enough through both sets of corners.</p> <p>A look at the list of race winners over the years confirms that at Darlington talent tells. Few journeymen drivers have won at Darlington - through the years the winner's circle has mostly welcomed the sport's enduring stars. Those legendary drivers have dominated the competition, and at a track where it is so difficult to win even once, those who have unlocked Darlington's mysteries have been able to win again and again; of the 43 men who have won a NASCAR Sprint Cup Series&#8482; race there through 2008, more than half - 24 to be exact - have won at least twice. Richard Petty and Buck Baker have the three victories each to their credit; Bill Elliott and Harry Gant were four-time winners; Bobby Allison, Darrell Waltrip and Cale Yarborough have won five times; and in recent years, as the competition in NASCAR intensified, Jeff Gordon has found his way first under the checkered flag a remarkable seven times.</p> <p>When it comes to the true Darlington legends, however, two drivers stand apart from the rest. Dale Earnhardt, Sr. won nine times. \"You never forget your first love,\" Earnhardt was quoted as saying. \"Whether it's a high school sweetheart, a faithful old hunting dog, or a fickle race track in South Carolina with a contrary disposition. And, if you happen to be a race car driver there's no victory so sweet, so memorable, as whipping Darlington Raceway.\"</p> <p>But the most successful driver of all time at what is perhaps the most difficult track on the NASCAR circuit is David Pearson, the '60s and '70s ace known as the Silver Fox for his smooth style behind the wheel. Ten times at Darlington Pearson outfoxed the other drivers and the track itself. If he'd won any more, they'd have had to turn over the deed to the track to him.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/darlingtonraceway","gallery_images":"1,2,3,4,5,6,7,8,9,10,11,12,13,14","gallery_prefix":"darlingtonraceway-gallery","large_image":"darlingtonraceway-large.jpg","logo":"/img/logos/tracks/darlingtonraceway-logo.png","north":"90deg","num_svg_images":5,"small_image":"darlingtonraceway-small.jpg","track_id":115,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_darlington/115-darlington/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}