{"coordinates":"42.0678836,-84.2470556","detail_copy":"Michigan International Speedway was completely rebuilt by iRacing, including the new track surface in 2018.\r\n<br> <br>\r\nOriginally designed by Charles Moneypenny, the same architect who created Daytona International speedway, and located in the vacation-area Irish Hills of the south-central part of the state, Michigan International Speedway is best-known for the awesome speeds and competitive racing spawned by its broad racing surface and 73-foot-wide, 18-degree banked turns. Michigan's width and steep banking ensure there's always more than one racing groove, and the fact that MIS is a non-restrictor-plate track means drivers have more than enough power to make a challenge out of the turns at both ends of the track.\r\n<br> <br>\r\nOnce upon a time Indy cars frolicked on those high banks at breathtaking speeds, witness Paul Tracy's record qualifying lap of 234.949 mph. Today, Michigan regularly vies with Daytona, Talladega and Texas as NASCAR's fastest speedway, with Ryan Newman holding the NASCAR Cup Series track record of 194.232 mph. While MIS' Stirling Moss-designed 3.1-mile road course and the Can-Am and Trans-Am races of days gone-by are now just fond memories, the track has a 1.9-mile interior road course that has challenged IMSA and amateur racers down through the years.\r\n<br> <br>\r\nIt's no wonder some of stock car racing's most legendary drivers have thrived on the banks of MIS since Cale Yarborough defeated Lee Roy Yarbrough in the inaugural NASCAR race there in 1969. Richard Petty and David Pearson, Bobby and Davey Allison, Dale Earnhardt Senior and Junior, Jeff Gordon and Jimmie Johnson have all since added their names to the roll call of MIS winners, one that also includes names like Mario Andretti, A.J. Foyt, Al Unser, Rick Mears and Alex Zanardi from the days when Indy cars raced in the Irish Hills, not to mention Parnelli Jones and Mark Donohue, Trans-Am winners on the MIS road course that, once upon a time, snaked through the countryside behind the backstretch. Allison to Yarborough, Andretti to Zanardi, the world's greatest race drivers have been coming to Michigan International Speedway to test their mettle for more than 40 years. And the fans have followed by the hundreds of thousands.\r\n<br> <br>\r\nDetroit-area real-estate developer Larry LoPatin had the vision to build first Michigan International Speedway and then a Southwestern duplicate, Texas World Speedway in College Station, TX. But LoPatin's reach exceeded his grasp and it was a fellow named Roger Penske who stepped in and turned MIS into an auto-racing showcase. Under Penske's direction, MIS grew from a rather modest seating capacity of 25,000 to more than 125,000 between 1972 and '99. And the first order of business when the International Speedway Corporation acquired the facility from Penske? Add another 10,000 seats in Turn Three, enhancing MIS' status as the largest sports facility in the Wolverine State.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/michiganinternationalspeedway","gallery_images":"1,2,3","gallery_prefix":"michigan-gallery","large_image":"michiganinternationalspeedway-large.jpg","logo":"/img/logos/tracks/michiganinternationalspeedway-logo.png","north":"160deg","num_svg_images":6,"small_image":"michiganinternationalspeedway-small.jpg","track_id":276,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_michigan_2018/276-michigan-2018/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}