{"coordinates":"56.1315220,-3.5090430","detail_copy":"<p>Based in Fife, Scotland, Knockhill Racing Circuit is Scotland's premier motorsports venue. The 1.267-mile road course was formed by connecting service roads to a mineral railway that had been out of service for more than 20 years, and has been a regular host of both professional and amateur British and Scottish racing events ever since its opening in 1974.</p><p>Knockhill packs a big punch in a small space, not only for its numerous track layouts, but also for being the United Kingdom's first track to gain certification to run in both directions in the modern era in 2012. Between its International and National layouts, a half-mile tri-oval, and an interior section utilized for rallycross and supermoto racing, its utility for just about any type of racing imaginable has been proven time and again.</p><p>The International layout, however, is the best known, as it's used for top-tier events like the British Touring Car and Superbike Championships. Knockhill features nine corners and over 120 feet of elevation changes on its main layout, with lengthy straightaways both leading into and out of the final corner, known as Taylor's hairpin. Aside from racing, demonstration runs in Formula 1 cars and driving experiences ranging from the world's top supercars to entry-level cars for junior drivers are mainstays of the track's annual program.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/knockhillracingcircuit","gallery_images":null,"gallery_prefix":null,"large_image":"knockhillracingcircuit-large.jpg","logo":"/img/logos/tracks/knockhillracingcircuit-logo.png","north":"90deg","num_svg_images":8,"small_image":"knockhillracingcircuit-small.jpg","track_id":427,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_knockhill/427-knockhill-rallycross/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}