{"coordinates":"40.6906568,-82.6397807","detail_copy":"<p>The Mid-Ohio Sports Car Course ranks among America's premier road racing facilities. The track has hosted every major American road racing series worthy of the name, and the list of drivers who have stood atop Mid-Ohio's victory podium is a Who's Who of racing greats. <p>Constructed near Mansfield, Ohio in 1962 by Les Griebling and several prominent local businessmen, Mid-Ohio originally featured a 2.4 mile, 15 turn layout consisting of a blend of fast, medium and slow speed corners, one long straightaway and several dramatic elevation changes. Although the track was updated over the years, Jim Trueman (founder of the Red Roof Inn motel chain and TrueSports Racing) thoroughly modernized the facility after acquiring the track in 1982. In addition to a new garage, paddock and operations tower, the update tweaked the track layout by by-passing the Keyhole chicane, resulting in an optional 2.25 mile, 13 turn circuit.</p> <p>Both configurations begin with the daunting Turn One, a blind, 100  mph corner, include a roller-coaster series of esse bends known as \"Madness\" and conclude with a near-360 degree Carousel that has a virtually unlimited number of lines and apexes. More recently, a \"short course\" was created by connecting the exit of Turn One to the backstraightaway, and there is also a new mini-oval utilizing the Keyhole Hairpin and another 180 degree turn linking the track on the approach and exit to the Keyhole.</p> <p>In its near-fifty year history, Mid-Ohio has hosted America's premier racing series including the United States Road Racing Championship, Can-Am, Trans-Am, Formula 5000, IMSA Camel GT, American Le Mans Series, Grand American Road Racing Championship, Champ Car World Series and the IZOD IndyCar Series&#8482;. As well, Mid-Ohio has long been a club racing mecca and enjoyed a 12 year run as the home of the Sports Car Club of America's National Championship Runoffs from 1994 through 2005.</p> <p>These days the Mid-Ohio Sports Car Course schedule includes race weekends featuring the IZOD IndyCar Series&#8482;, the American Le Mans Series, the Grand-Am Rolex Sports Car Series&#8482; and the American Motorcycle Association Pro Racing, together with SCCA and other amateur road racing competition.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/midohiosportscarcourse","gallery_images":"1,2,3","gallery_prefix":"midohiosportscarcourse-gallery","large_image":"midohiosportscarcourse-large.jpg","logo":"/img/logos/tracks/midohiosportscarcourse-logo.png","north":"90deg","num_svg_images":6,"small_image":"midohiosportscarcourse-small.jpg","track_id":153,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_midohio/153-midohio-full/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}