{"coordinates":"41.0543442,-75.5134730","detail_copy":"<p>Called the Tricky Triangle by some, the Bermuda Triangle by others, three-cornered Pocono Raceway is utterly unique. Situated in the Pocono Mountains of northeastern Pennsylvania , the 2.5 mile tri-oval features three very different turns connected by straightaways of varying length. Turn One is banked at 14 degrees, Turn Two (aka the \"Tunnel Turn\") is banked at eight degrees and Turn Three at six degrees. Pocono's main straightaway is the longest on any North American speedway at 3,740 feet, the \"Long Pond\" straightaway stretches for 3,055 feet between Turns One and Two, while the run from Turn Two to Turn Three is a mere 1,780 feet.</p> <p>The resulting speedway poses special demands on drivers and engineer alike, for a chassis that works well on the steeply-banked Turn One will be less than ideal for the flatter Turn Two, let alone Turn Three, and the downforce necessary for maximum grip in any of the turns will slow a car on the two long straightaways. And Turn Three requires heavy braking - in some cases even a gearchange - making Pocono Raceway among the world's most challenging speedways.</p> <p>Pocono Raceway first opened for business in 1969 featuring a three quarter mile oval. The 2.5 mile speedway was completed in 1971 and immediately began hosting one of the jewels in Indy car racing triple crown of 500 mile races. Local hero Mario Andretti battled the likes of A.J. Foyt, Al and Bobby Unser, Johnny Rutherford and Gordon Johncock in , USAC-sanctioned Indy car races. NASCAR was also at Pocono from the early days, as witnessed by the fact that Richard Petty won NASCAR's inaugural Pocono 500 in 1974. Pocono also staged a number of top flight sports car races on its combination road course/oval layouts in the 1970s and 1980s, as well as various short track events on the original three-quarter mile oval encircling the main pit area.</p> <p>Located equa-distantly from New York City and Philadelphia - and with the rabid race fans of central Pennsylvania nearby - the track attracts overflow crowds for its two NASCAR weekends. Since Petty's win in 1974, the greatest names in stock car racing have visited Victory Lane at Pocono... not to mention Denny Hamlin who attributed much of his early success at Pocono to his sim-racing experience! Pocono Raceway also plays host to the ARCA Series as well as a round of the NASCAR Truck.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/poconoraceway","gallery_images":"1,2,3","gallery_prefix":"poconoraceway-gallery","large_image":"poconoraceway-large.jpg","logo":"/img/logos/tracks/poconoraceway-logo.png","north":"90deg","num_svg_images":8,"small_image":"poconoraceway-small.jpg","track_id":136,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_pocono/136-pocono-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}