{"coordinates":"35.3511641,-80.6912655","detail_copy":"<p>Opened in 1960 by Bruton Smith and NASCAR driving legend Curtis Turner with the running of the longest stock car race in history, the World 600, a year later the 1.5-mile the Charlotte Motor Speedway was in bankruptcy, done in by a huge infield rock formation that ballooned construction costs far beyond what its two founders had forecast.</p> <p>Almost 50 years later nearly everything is different. More than 160,000 seats ring the race track, which was the first superspeedway to install lights for night racing; the first race track to incorporate a condominium apartment complex overlooking the racing surface; the first to build an office complex with the same view; and the first to open a year-round club where members can spectate during races and socialize with fellow club members at other times. Everything is very different from 1960 except for one thing; Charlotte Motor Speedway is still owned by Bruton Smith.</p> <p>Actually, Charlotte Motor Speedway is today the queen of a six-track, publically-traded motorsports empire controlled by Smith. Ousted from the track in 1962, Smith went on to a successful career in automotive retailing and by 1975 was able to buy back control. With the legendary H.A. \"Humpy\" Wheeler managing the day-to-day operations and promoting the races with flair and imagination, the track was soon among the most successful in the world.</p> <p>Today the Charlotte Motor Speedway complex today incorporates not just the 1.5-mile quad oval with its 24-degree banking in the corners and 5-degree banked straightaways, but a 2.25-mile road course - that ancient rock formation provides sufficient elevation change to give one of the challenging infield corners a blind apex - and a quarter-mile asphalt oval utilizing part of the speedway's frontstretch and pit road (all three of which are included in the iRacing.com simulation.)</p> <p>The facility also includes a .6-mile karting layout in the speedway's infield; a one-fifth-mile oval located outside Turn Three of the superspeedway, and a state-of-the-art four-tenths-mile clay oval just across Highway 29. And soon construction will commence on a quarter-mile drag strip, scheduled to host professional drag racing. If it races on four wheels, there's a place for it to run at Charlotte Motor Speedway.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/charlottemotorspeedway","gallery_images":"1,2,3","gallery_prefix":"charlottemotorspeedway-gallery","large_image":"charlottemotorspeedway-large.jpg","logo":"/img/logos/tracks/charlottemotorspeedway-logo.png","north":"90deg","num_svg_images":7,"small_image":"charlottemotorspeedway-small.jpg","track_id":39,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_charlotte/39-charlotte-legendsoval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}