{"coordinates":"33.3859794,-84.3184714","detail_copy":"In the era of restrictor-plate racing, the 1.54-mile Atlanta Motor Speedway vies with fellow Speedway Motorsports facility Texas Motor Speedway for the title of \"fastest track in NASCAR.\" Qualifying lap averages generally are in the range of 193 mph (and an all-time lap record of 197  mph), so the 24-degree banked quad-oval has earned its nickname, \"Real Racing, Real Fast.\" In addition to hosting the NASCAR Monster Energy Cup Series, NASCAR Xfinity Series, and NASCAR Camping World Truck Series, as well as ARCA stock cars and (for a while) IRL Indy cars on the big track, Legends Cars and their Bandolero and Thunder Roadster brethren race year-around on a quarter-mile paved oval that uses parts of the pit lane and front stretch, connected by 180-degree turns on either end. \r\n<br><br>\r\nWith 125,000  seats, Atlanta Motor Speedway, located about 20 miles south of downtown Atlanta in Hampton, GA, has come a very long way from the first race, held in 1960 and won by NASCAR legend Fireball Roberts, who also took the pole at 133 mph. Spectators from that day, who watched from one small grandstand or on blankets spread out on an adjacent dirt bank, wouldn't begin to recognize the facility today, even down to the name. Dubbed Atlanta International Raceway when it opened, the track struggled financially through the '60s and '70s before finding a degree of stability in the '80s.  (Future Georgia governor and President of the United States Jimmy Carter briefly worked as a ticket-seller on race weekends in the '60s.)\r\n<br><br>\r\nReal change came following Bruton Smith's purchase of the facility in 1990, with the culmination of the transformation of Atlanta International Speedway occurring in 1997, with extensive reconfiguration that switched front and back straightaways and added a double-dogleg in the new front straightaway. In the seven intervening years, new grandstands sprouted almost every year, and a nine-story tower, Tara Place, that houses the track offices and a number of luxury condominiums. And the building continues to this day; in 2006 the Winners Grandstand was erected overlooking the double-dogleg front stretch and pits, and atop the new private-membership Club One, which features climate-controlled views of the entire track.\r\n<br><br>\r\nIn 2018 iRacing added two Rallycross configurations to the infield (Long & Short), further adding to the utility of the track.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/atlantamotorspeedway","gallery_images":"1,2,3","gallery_prefix":"atlantamotorspeedway-gallery","large_image":"atlantamotorspeedway-large.jpg","logo":"/img/logos/tracks/atlantamotorspeedway-logo.png","north":"160deg","num_svg_images":12,"small_image":"atlantamotorspeedway-small.jpg","track_id":52,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_atlanta/52-atlanta-legendsoval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}