{"coordinates":"33.37487,-112.313415","detail_copy":"<p>Nestled in the foothills of Arizona's Estrella Mountains, Phoenix International Raceway is one of America's most challenging ovals. Though originally built for open wheel racing, over the past two decades the desert flower has become even more famous for stock car competition.</p> <p>With its short front straight and asymmetrical layout - including a trademark left-hand dog leg on the backstretch -- this demanding one mile circuit has been a favorite with top driving talent since it opened in 1964. That fall Mario Andretti got his big career break when he manhandled an old front engine Offy \"roadster\" IndyCar around the tricky track.</p> <p>Other legendary Indy shoes including A.J. Foyt, Parnelli Jones, numerous Unsers, Michael Andretti, Sam Hornish, Jr and Dario Franchitti all competed successfully at PIR, as did Dutchman Arie Luyendyk a two-time winner who holds the IndyCar lap record of 183 mph at PIR.</p> <p>NASCAR's top series first came to the Valley of the Sun in 1988, and though they lap nearly 50 mph slower, stock car drivers have found PIR every bit as challenging as their open wheel counterparts. The list of NASCAR Sprint Cup Series winners reads like a Who's Who of NASCAR, including Jimmie Johnson, Jeff Gordon, the father and son Earnhardts, Bill Elliott, Tony Stewart, Mark Martin, Kurt and Kyle Busch and Matt Kenseth. </p> <p>In addition to NASCAR's top tier, the NASCAR Nationwide Series, NASCAR Camping World Truck Series and K&N Pro Series West also compete at PIR and each year , USAC sanctions the Copper World Classic, a weekend festival of Silver Crown and Midget racing. The facility also includes a 13 turn, 1.51 mile (2.43 km) road course that utilizes most of the oval along with a twisting infield section that hosted Rolex GRAND-AM Road Racing Series events from 2000-06.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/phoenixinternationalraceway2008","gallery_images":"1,2,3","gallery_prefix":"phoenixinternationalraceway2008-gallery","large_image":"phoenixinternationalraceway2008-large.jpg","logo":"/img/logos/tracks/phoenixinternationalraceway-logo.png","north":"90deg","num_svg_images":9,"small_image":"phoenixinternationalraceway2008-small.jpg","track_id":306,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_phoenix/306-phoenix-rallycross/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}