{"coordinates":"51.3581048,0.2536338","detail_copy":"<p>Challenging. Picturesque. Spectator-friendly. Those are the words most commonly associated with Brands Hatch, a former home of the British Grand Prix and a favorite of race drivers and fans alike.</p> <p>Situated some 30 miles southeast of London, Brands Hatch was the scene of motorcycle events in the 1920s on a three quarter mile dirt track carved out of a forested bowl that continues to be a distinguishing feature of the facility. Following World War II the oval was paved and modified to include the Druids Bend hairpin. With the construction of permanent pit facilities, Brands Hatch became one of the major motorsports venues in England. The facility was further enhanced in 1959 with the addition of more than a mile of track that brought the full circuit to 2.3 miles in length, with the original track serving as the nucleus for today's club circuit.</p> <p>Both circuits are renowned for their demanding layouts and dramatic elevation changes, exemplified by the turn known as Paddock Hill Bend. Approached along the curving pit straightaway, \"Paddock\" features a blind, uphill approach to an off-camber apex beyond the crest of the hill. Next, the road plunges downhill then climbs abruptly to Druids Bend before diving down through Graham Hill Bend to Cooper Straight . . . and that's just the first half mile.</p> <p>Brands Hatch hosted its first major international race in 1960, when Jack Brabham won the non-championship Silver City Trophy Formula One race, and was selected as the site of the British Grand Prix four years later. Subsequently, Brands Hatch alternated with Silverstone as the home of the British Grand Prix, producing many noteworthy winners from Jim Clark to Niki Lauda and Alan Jones.</p> <p>Although safety concerns saw the British GP move to Silverstone in 1987, Brands Hatch continues to host leading international and national events including the World and British Touring Car Championships, the FIA Formula Two and British Formula Three championships and the British Superbike Championship as well the Formula Ford Festival which has served as a springboard for the likes of Derek Daly, Mark Webber and Jenson Button.</p> <p>Brands Hatch has also hosted Indy car races on two occasions, indeed the 1.2 mile club track's official name is the Indy circuit. Rick Mears won a USAC-sanctioned race there in 1978 while Sebastien Bourdais claimed the first of his 31 Champ Car wins on the Indy circuit 25 years later.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/brandshatchcircuit","gallery_images":"1,2,3","gallery_prefix":"brandshatchcircuit-gallery","large_image":"brandshatchcircuit-large.jpg","logo":"/img/logos/tracks/brandshatchcircuit-logo.png","north":"90deg","num_svg_images":9,"small_image":"brandshatchcircuit-small.jpg","track_id":145,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_brandshatch/145-brandshatch-grandprix/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}