{"coordinates":"25.4517775,-80.4110895","detail_copy":"<p>The old saying, \"it's an ill wind that blows no good,\" could be appropriately applied to Homestead-Miami Speedway. In the wake of Hurricane Andrew in August, 1992, South Florida racing promoter Ralph Sanchez began organizing construction of the region's first major-league motorsports facility as part of the reconstruction of the devastated Homestead community. Ground-breaking took place the following August and on Aug. 24, 1993, the first event, a NASCAR Xfinity Series race, was won by Dale Jarrett.</p> <p>Longtime host to NASCARs season finale for the top three series, the 1.5-mile variable-banked Homestead-Miami oval has also hosted Indycar and IMSA events. SCCA amateur races and CSS motorcycle races also take place on the road circuit.</p> <p>With more than a thousand palm trees and a Caribbean color scheme, the facility projects a South Beach flavor that distinguishes Homestead-Miami from other major race tracks in America. It took a while longer to get the right combination for the racing surface. In its first iteration, the track had four separate low-banked corners - that configuration failed to promote good racing, and unfortunately also provided bad crash angles. Widening the aprons failed to correct either of these problems.</p> <p>A major reconfiguration of the track during the summer of 1997 brought a more conventional layout - sweeping 180-degree corners at either end of the oval. Close, but still no cigar. But the most recent work on the track, during which the track assumed variable banking - up to 20 degrees in the corners, flattening to 3 degrees on the straightaways - has done the trick. Everyone agrees, at Homestead-Miami, the beauty is now more than skin deep.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/homesteadmiamispeedway","gallery_images":"1,2,3","gallery_prefix":"homesteadmiamispeedway-gallery","large_image":"homestead-miamispeedway-large.jpg","logo":"/img/logos/tracks/homestead-miamispeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"homestead-miamispeedway-small.jpg","track_id":20,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_homestead/20-homestead-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}