{"coordinates":"52.8305468,-1.3810343","detail_copy":"<p>\"The heart of British motorsport,\" Donington Park has hosted virtually every form of motor racing from World Championship Formula One, Touring Car, MotoGP and Superbike events to the British Touring Car and Truck Championships.</p> <p>Situated on the Donington Hall estate in Leicestershire, the original 2 mile circuit debuted in 1931 with a motorcycle race utilizing the estate's roads. The roads were later widened to accommodate automobile races and the 1930s ended with two memorable Donington Grands Prix won by Bernd Rosemeyer and Tazio Nuvolari in their Auto Union \"Silver Arrows.\"</p> <p>Donington Park was used as a military vehicle depot during World War II and it wasn't until businessman and car collector Tom Wheatcroft rebuilt the track that motorsports returned to the venue in the 1970s. The \"new\" Donington Park utilized most of the original layout, along with an additional loop featuring the Melbourne and Goddard's hairpins.</p> <p>Donington Park became a fixture on the club and national racing calendars, as well as home to the British Moto GP and hosted a 1993 European Grand Prix that saw Ayrton Senna score perhaps the most brilliant win of his Formula One career.</p> <p>The facility was later leased to Donington Ventures Leisure Ltd which demolished portions of the track in order to upgrade the facility in the hopes of making Donington Park the permanent home of the British Grand Prix. After those plans failed to materialize, the Wheatcroft family regained control of the circuit in 2009. The rebuilt Donington Park now stages a variety of club and national races as well as the British round of the World Touring Championship.</p> <p>In addition to motorsports, Donington Park hosts a variety of events including music festivals and public markets and is home to the Donington Grand Prix Museum, the world's foremost collection of Formula One cars.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/doningtonparkracingcircuit","gallery_images":"1,2,3","gallery_prefix":"doningtonparkracingcircuit-gallery","large_image":"doningtonparkracingcircuit-large.jpg","logo":"/img/logos/tracks/doningtonparkracingcircuit-logo.png","north":"90deg","num_svg_images":6,"small_image":"doningtonparkracingcircuit-small.jpg","track_id":233,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_donington/233-donington-gp/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}