{"coordinates":"27.4550124,-81.3518741","detail_copy":"<p>Laid out on the runways of a World War II air base and the adjacent roadways, Sebring International Raceway is the oldest permanent road-racing circuit in the United States. It hosted its first race on New Year's Eve, 1950, a six-hour handicap event won by a diminutive Crosley Hotshot two-seat roadster. The first \"12-Hour Grand Prix of Endurance\" was held two years later, and for several years Sebring was the site of America's only real international races. In 1959 Sebring was the site of the first United States Grand Prix before the event found a permanent home at Watkins Glen. For nearly 60 years the world's top racers have competed for victory at this storied track nestled in central Florida's orange groves.</p> <p>The original racecourse was the longest in North America, at more than five miles around. Today Sebring International Raceway has three configurations, the longest of which is the 3.7-mile circuit used for the mid-March annual Mobil 1 12 Hours of Sebring. Like the original layout, the current one is a mix of smooth asphalt-paved roadway and car-busting, tooth-rattling concrete-slab runways. Experts claim that 12 hours racing at Sebring is twice as hard on a car - and its drivers - than 24 hours at Daytona or Le Mans. With a wide variety of types of corners, from featureless wide-open throttle, wide-radius sweepers to a tight hairpin, Sebring offers a driver a variety of cornering challenges, and major bumps make a car dance.</p> <p>Sebring's shorter configuration is a popular year-round test facility for major racing teams, and a venue for SCCA club races. The full circuit is also host to major vintage race meets. You can see today the very same cars that were competing for victory honors 50 years ago.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/sebringinternationalraceway","gallery_images":"1,2,3","gallery_prefix":"sebringinternationalraceway-gallery","large_image":"sebringinternationalraceway-large.jpg","logo":"/img/logos/tracks/sebringinternationalraceway-logo.png","north":"90deg","num_svg_images":5,"small_image":"sebringinternationalraceway-small.jpg","track_id":97,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_sebring/97-sebring-club/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}