{"coordinates":"-38.5011396,145.2355528","detail_copy":"<p>Australia's premier permanent road course, Phillip Island is a 2.7-mile (4.4 km) thrill ride of a race track situated on an island just off the southern coast near Melbourne. The 12-turn circuit features a long main straightaway, hair-raisingly fast turns, tight hairpins and dramatic elevation changes, including a precipitous drop from Lukey Heights to the tight Turn Ten. Set against the deep blue backdrop of the Bass Strait separating the Australian mainland from Tasmania, Phillip Island is among the world's spectacular motorsports venues.</p> <p>Phillip Island has a rich motorsports history dating back to the early twentieth century when the 10 Miles Road Race (since known as the inaugural Australian Grand Prix) was staged over one of the world's first \"ro-vals\" -- a rectangle of public roads with four identical corners. As speeds increased a new Phillip Island circuit was developed around an existing airfield and operated into the mid-1930s. In the aftermath of World War II, a new, permanent track was built on the edge of the island's south coast and hosted its first race in 1956. The facility experienced good times and bad, in part due to the track maintenance required by its roller-coaster character. The Phillip Island circuit closed its doors from 1962-66 and again from the late 1970s until it reopened in 1989 as the site of the Australian round of the World Motorcycle Championship.</p> <p>Phillip Island has since come to be regarded as one of the world's most challenging race tracks - be it on two or four wheels. The facility hosts world class auto and motorcycle racing each year including the Australian V8 Supercar Championship as well as the Australian MotoGP and a round of the World Superbike Championship.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/phillipislandcircuit","gallery_images":"1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18","gallery_prefix":"phillipislandcircuit-gallery","large_image":"phillipislandcircuit-large.jpg","logo":"/img/logos/tracks/phillipislandcircuit-logo.png","north":"90deg","num_svg_images":9,"small_image":"phillipislandcircuit-small.jpg","track_id":152,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_phillipisland/152-phillipisland/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}