{"coordinates":"34.8455935,136.5367582","detail_copy":"<p>One of the world's truly great race tracks, Suzuka has been the home of the Japanese Grand Prix since the 1980s and its flowing layout regularly puts the circuit at or near the top of the list of most Formula One drivers' favorites.</p> <p>Designed by noted circuit architect John Hugenholtz (who also designed the original Zandvoort circuit), Suzuka opened in 1962 and served primarily as a test track for Honda and as the site of sports car racing including the Suzuka 1000K and the 8 Hours of Suzuka and MotoGP motorcycle events. Suzuka was nominated to stage the Japanese Grand Prix in 1987 and has often been the site of the Formula One season finale. As such, Suzuka has been the decisive event in some of the closest battles for the World Championship of Drivers and has witnessed a number of controversial incidents, including clashes between Ayrton Senna and Alain Prost. Suzuka also hosted non-championship NASCAR races in 1996 and '97.</p> <p>In addition to its signature crossover layout, Suzuka features a number of notable challenges including a testing series of esses, the multi-apex Spoon Curve and dauntingly fast 130R corner. The race track also serves as the foundation for a major sports and entertainment facility including an amusement park whose giant Ferris Wheel is prominent in photographs and television images of the circuit.</p> <p>After a two year (2007-08) absence when the Japanese Grand Prix was run at the Fuji circuit, Suzuka underwent significant safety upgrades before hosting the event's return in 2009.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/suzukainternationalracingcourse","gallery_images":"1,2,3","gallery_prefix":null,"large_image":"suzukainternationalracingcourse-large.jpg","logo":"/img/logos/tracks/suzukainternationalracingcourse-logo.png","north":"90deg","num_svg_images":4,"small_image":"suzukainternationalracingcourse-small.jpg","track_id":173,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_suzuka/173-suzuka-moto/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}