{"coordinates":"36.7092845,-78.8712013","detail_copy":"<p>A mecca for southern Virginia short-track racing for over half a century, South Boston Speedway today bills itself as \"America's Hometown Track.\" South Boston Speedway - SoBo to its many fans - was a quarter-mile dirt track when it opened its gates in 1957, and in that dusty incarnation hosted NASCAR Sprint Cup Series&#8482; stock car racing as well as a host of other stock and modified classes.</p> <p>Paved in 1962 it grew then to .357 miles before a final growth spurt brought in 1994 the track to its current configuration of 4/10 miles with 12 degrees of banking in the turns and 10 degrees on its 360-yard straightaways. The 45-foot width helps passing and keeps the racing close.</p> <p>Today the Late Model class is the headliner of the four regular classes at SoBo, but Modifieds race there regularly (and hold the overall track record at 99.9  mph) and so do Legends Cars. Owned by Joe Mattioli III since 2000, who has invested heavily to make the facility one of the finest short tracks in America, SoBo eschews weekly racing. But with 18 race meets on the annual schedule, the track is active on an average of three weekends per month during the racing season.</p> <p>The list of South Boston Speedway stars over the years reads like the history of NASCAR. Richard Petty won here five times, and the list of other legendary names includes Joe Weatherly, David Pearson, Buck and Buddy Baker, Tiny Lund, Wendell Scott (the first African-American driver to compete regularly at the track) Darrell Waltrip, Bobby Allison, Cale Yarborough, Dale Earnhardt and the former NASCAR champion and television broadcaster Benny Parsons, who captured his first career NASCAR Sprint Cup Series&#8482; victory in 1971 in South Boston's final NASCAR Sprint Cup Series&#8482; race.</p> <p>SoBo grads swept the 2002 Daytona 500, with hometown favorite Ward Burton becoming the first Virginian to win the \"Great American Race.\" South Boston's 1995 champion Elliott Sadler finished a close second, while 1981 champion Geoffrey Bodine finished third.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/southbostonspeedway","gallery_images":"1,2,3,4,5,6,7,8","gallery_prefix":null,"large_image":"southbostonspeedway-large.jpg","logo":"/img/logos/tracks/southbostonspeedway-logo.png","north":"90deg","num_svg_images":8,"small_image":"southbostonspeedway-small.jpg","track_id":14,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_southboston/14-southboston/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}