{"coordinates":"45.5032189,-73.5288816","detail_copy":"<p>Circuit Gilles-Villeneuve is situated on Montreal's Ile Notre-Dame, a man-made island in the St. Lawrence River which was the site of the 1967 World's Fair (Expo '67). Based on the site's existing roads, the circuit debuted with the 1978 Canadian Grand Prix and has since become the home of Canada's annual Formula One race. In addition the facility has hosted events in the FIA World Sportscar Championship, the Champ Car World Series and the GRAND-AM Rolex Sports Car Series as well as NASCAR's Canadian Tire and Nationwide Series.</p> <p>Originally christened Ile Notre-Dame Circuit, the track was officially renamed Circuit Gilles-Villeneuve following the legendary Canadian driver's fatal accident during qualifying for the 1982 Grand Prix of Belgium. The circuit has also undergone a number of alterations over the years to arrive at its current 13 turn, 2.71 mile (4.361 km) configuration.</p> <p>Something of a hybrid street circuit/natural road course, Circuit Gilles-Villeneuve consists of a unique blend of high speed curves and tight chicanes, together with a long straightaway preceded by the tight L'Epingle hairpin. Notoriously hard on brakes, the circuit is also known for its \"Wall of Champions\" on the exit of the final chicane where World Champions Damon Hill, Michael Schumacher and Jacques Villeneuve crashed during Canadian Grands Prix.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/circuitgillesvilleneuve","gallery_images":"1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16","gallery_prefix":"circuitgillesvilleneuve-gallery","large_image":"circuitgillesvilleneuve-large.jpg","logo":"/img/logos/tracks/circuitgillesvilleneuve-logo.png","north":"90deg","num_svg_images":9,"small_image":"circuitgillesvilleneuve-small.jpg","track_id":218,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_montreal/218-montreal/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}