{"coordinates":"53.1751389,-2.62258","detail_copy":"<p>An integral part of the fabric of the British motorsports scene for more than half a century, Oulton Park is one of the world's most picturesque - and challenging - road circuits. Originally developed by the Mid-Cheshire Car Club on an estate between Chester and Liverpool, Oulton Park has been a staple of the British club racing scene as well as host to a dazzling variety of top rank professional races, from the British Formula 3 and British Touring Car Championship up to and including a series of non-championship Formula One races in the 1960s and '70s known as the International Gold Cup.</p> <p>Oulton Park is famous for its numerous and severe changes in elevation -- and a corresponding number of blind turns, many of which are taken at high speed and thus require a high level of commitment. The names of some of these corners such as Old Hall, Cascades, Dear Leap and Knickerbrook are etched in racing lore.</p> <p>Although the original 2.8 mile full international circuit remains largely intact, over the years a variety of shortcuts and chicanes have been constructed. As a result, more than half a dozen different circuit configurations are used on a regular basis, the most well known of which include the six turn, 1.6 mile Foster's circuit, the seven turn, 2.2 mile Island circuit and the 17 turn, 2.8 mile International Circuit.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/oultonparkcircuit","gallery_images":"1,2,3","gallery_prefix":"oultonparkcircuit-gallery","large_image":"oultonparkcircuit-large.jpg","logo":"/img/logos/tracks/oultonparkcircuit-logo.png","north":"90deg","num_svg_images":9,"small_image":"oultonparkcircuit-small.jpg","track_id":183,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_oulton/183-oulton-intbrittens/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}