{"coordinates":"34.1521900,-83.8151100","detail_copy":"<p>If they built a roller-coaster for road-racing drivers, it would look a lot like Road Atlanta, the 2.54-mile hill-and-dale 12-turn circuit nestled in the red-earth hill country 35 miles north of Atlanta. The hub of the Panoz Motor Sports Group, Road Atlanta is today home to the American Le Mans Series highlight event, the thousand-mile Petit Le Mans, and also hosts Sports Car Club of America national and regional amateur sports car racing (Road Atlanta was for 23 years home to the SCCA's national championship Runoffs) and the newly reborn Trans-Am. Other Road Atlanta events include National Auto Sport Association sports car racing; vintage racing organized by HSR and SVRA; a round of the Ferrari Challenge, plus professional and amateur motorcycle racing, karting, drifting and Skip Barber Racing schools and race meets.</p> <p>But from the day the track opened in the fall of 1970 with the running of an SCCA Can-Am race, drivers have found themselves alternately mesmerized and terrified by the serpentine rhythms of this challenging race track.</p> <p>A single lap begins with a gut-sucking very fast uphill right-hand sweeper, followed by a left-hander over the crest of a hill, and right into the downhill and uphill combination called the Esses. Then a brief downhill straightaway, followed by the banked 90-degree fast Turn 6 and almost immediate hard braking for the slowest, tightest corner on the course. Turn 7 leads onto the so-called back straight, which actually wends its pedal-to-the-metal way right and left and up over a crest and then down a hill.</p> <p>A gentle right followed by a sharp left and a right left were added following Don Panoz's purchase of the track in 1996. This eliminated perhaps the scariest few hundred feet of pavement in North America, Road Atlanta's notorious \"dip\", a suspension-bottoming down-and-up taken by really fast cars at nearly 200 mph, which was then followed by very hard braking up a hill and through the thread-the-needle, blind-apex, under-the-bridge Turn 11, which is today negotiated under slightly less frenetic circumstances. But the fast downhill run through the sweeping right-hand Turn 12 onto the pit straight is just as hair-raising as it ever was. That's one lap of Road Atlanta; repeat as necessary.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/roadatlanta","gallery_images":"1,2,3","gallery_prefix":"roadatlanta-gallery","large_image":"roadatlanta-large.jpg","logo":"/img/logos/tracks/roadatlanta-logo.png","north":"90deg","num_svg_images":6,"small_image":"roadatlanta-small.jpg","track_id":127,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_roadatlanta/127-roadatlanta-full/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}