{"coordinates":"34.1104491,-117.9892554","detail_copy":"<p>Heir to the proud tradition of short-track racing in the Los Angeles basin, the Irwindale Speedway opened its gates in 1999, following the closing of the famed Ascot Speedway nine years earlier. Fans and competitors couldn't have dreamed they'd have it so good. While Ascot was a gritty dirt track that harkened back to the oldest traditions of short-track racing, Irwindale is clean, modern and filled with amenities for drivers, crews, fans and sponsors.</p> <p>The facility features banked, paved half-mile and third- mile oval tracks, and a state-of-the-art MUSCO lighting system that makes racing at night just like racing during the day. A Bose sound system ensures that everyone in the 15,000-seat grandstand can hear the announcer over the roar of the racing engines.</p> <p>NASCAR Late Model Stock Car Series&#8482; and Legends Cars are among the large number of classes that compete regularly at Irwindale. (Others include , USAC Midgets and Sprint Cars, Supermodifieds, Super Late Models, Trucks, Mini Stocks. To say nothing of drawing big crowds for drifting events and serving as the site for the world-record setting run by a radio-control car - 111 mph!)</p> <p>While Angelenos call it their home-town short track, Irwindale draws national attention for two of its annual special events. As the inheritor of short-track racing tradition in Southern California, Irwindale hosts the legendary Turkey Night Grand Prix, a series of Thanksgiving weekend races for Midgets and Sprint Cars that goes back to the 1950s. And since 2003, the half-mile mile oval has hosted the NASCAR Toyota All-Star Showdown&#8482;.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/irwindalespeedway","gallery_images":"1,2,3","gallery_prefix":"irwindalespeedway-gallery","large_image":"irwindalespeedway-large.jpg","logo":"/img/logos/tracks/irwindalespeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"irwindalespeedway-small.jpg","track_id":388,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_irwindale/388-irwindale-figureeightjump/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}