{"coordinates":"34.9758768,-79.6130802","detail_copy":"<p>Call it Rockingham Speedway, North Carolina Motor Speedway or just \"The Rock,\" Rockingham is among stock car racing's most historic race tracks. Opened in October, 1965, Rockingham hosted two NASCAR Grand National (now Sprint Cup) races annually until 2004 when it was dropped from the schedule of NASCAR's premier series. During those four decades, a virtual Who's Who of stock car racing visited Victory Lane at Rockingham, beginning with Curtis Turner, winner of 1965's inaugural American 500 and going on to include Richard Petty, David Pearson, Bobby Allison, Cale Yarborough, Darrell Waltrip, Bill Elliott, Dale Earnhardt, Dale Jarrett, Rusty Wallace, Jeff Gordon and Mark Martin, with Matt Kenseth taking the final win in 2004.</p> <p>Opened as a flat, one mile oval, Rockingham underwent a major overhaul in 1969 when it was reconfigured to a D-shaped, high banked track measuring just over a mile, with an infield road course added for good measure. The track surface has proven to be particularly abrasive, adding tire conservation to the track's already daunting challenges. In recent years, Rockingham has played host to NASCAR's Camping World Truck Series and K&N Pro Series East, the ARCA Racing Series presented by RE/MAX and Menards, the Whelen Southern Modified Tour and the UARA Stars Late Model Series.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/rockinghamspeedway","gallery_images":"1,2,3","gallery_prefix":"rockinghamspeedway-gallery","large_image":"rockinghamspeedway-large.jpg","logo":"/img/logos/tracks/rockinghamspeedway-logo.png","north":"90deg","num_svg_images":10,"small_image":"rockinghamspeedway-small.jpg","track_id":204,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_rockingham/204-rockingham-road/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}