{"coordinates":"29.1851690,-81.0727220","detail_copy":"<p>No one could have known it then, but when Daytona International Speedway opened in 1959, it marked the beginning of a new era in American motorsport. As a replacement for the old beach road course a few miles east, the opening of the high-banked, 2.5-mile Florida tri-oval represented the leading edge of a wave of construction of big, paved speed palaces. Before Daytona, Indianapolis was the only American oval track longer than 1.25 miles, and most racing took place on dirt ovals a mile or less in length. From the very first Daytona 500, won by Lee Petty in a three-way photo finish, those high banks, so steep that it is hard to walk up them, proved a favorable venue for wide-open stock car racing, and Daytona kicked off the growth of NASCAR as we know it today.</p> <p>Daytona was also the first multi-use facility, with a 3.56-mile road circuit incorporating the infield and most of the oval. Host not only to the Daytona 500, but also to the Rolex 24 season kick-off for the Grand-Am Rolex Sports Car Series&#8482;, the AMA's signature Daytona 200 during Bike Week, the WKA's Daytona KartWeek between Christmas and New Years and a host of driving-school, club and other events, Daytona's busy and diverse schedule confirms the track's motto, \"The World Center of Racing.\"</p> <p>Save for the racing surface itself, Daytona International Speedway's infrastructure has grown and changed to such a degree that it would be almost unrecognizable today to someone who hasn't seen it over the last 20 years. It is an amazing motorsport facility. But one thing hasn't changed over the past six decades: No driver can consider his or her career complete without notching a victory at Daytona. From Dale Earnhardt, who captured the Daytona 500 in 1998 after coming close so many times, to 14-year-old kart racers whose racing resumes are just beginning, a victory at Daytona is a mark of distinction.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/daytonainternationalspeedway2007","gallery_images":"1,2,3","gallery_prefix":"daytonainternationalspeedway2007-gallery","large_image":"daytonainternationalspeedway2007-large.jpg","logo":"/img/logos/tracks/daytonainternationalspeedway-logo.png","north":"90deg","num_svg_images":13,"small_image":"daytonainternationalspeedway2007-small.jpg","track_id":471,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_daytona/471-daytona-rallycross-short-nojoker/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}