{"coordinates":"36.2722847,-115.0124701","detail_copy":"<p>A 1.5-mile D-shaped oval with 20-degree graduated banking, Las Vegas Motor Speedway hosts all three of NASCAR's top stock car series, and has been a venue for top-tier open-wheel competition and sports car racing. A state-of-the-art motorsport facility, its nickname, \"the Diamond in the Desert\", is well deserved. Las Vegas Motor Speedway has the polished brilliance that is a trademark of Speedway Motorsports' properties, and it is truly multifaceted.</p> <p>Originally constructed in 1996, Las Vegas Motor Speedway held its first major event in September of that year, an IRL race won by Richie Hearn. The first NASCAR event, a NASCAR Craftsman Truck Series&#8482; race, followed two months later. The NASCAR Nationwide Series&#8482; paid a visit in 1997, before the NASCAR Sprint Cup Series&#8482; arrived in 1998, marking the beginning of the track's long-term success. <p>Changes to the oval in 2006 made it a more competitive venue for stock cars. This major renovation revamped the banking, upping if from a modest 12 degrees to 20. Not only that, but the corners were banked progressively, meaning the further up the racing surface, the steeper the banking. Lap speeds jumped and racing got more competitive. The current stock car track record, held by Kasey Kahne, is just under 185 mph. <p>Although the oval gets much of the prime-time attention these days, the facility's multiple infield configurations make the desert speed palace a great venue for road racing, karting and Legends Car racing. There are three different road courses, two that are confined to the infield and one that makes use of the big oval. The infield circuits are small but challenging and provide a good opportunity to test set-up packages. In addition, there are two short ovals, one pit-lane based and one in the infield, on which Legends Cars regularly compete.","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/lasvegasmotorspeedway","gallery_images":"1,2,3","gallery_prefix":"lasvegasmotorspeedway-gallery","large_image":"lasvegasmotorspeedway-large.jpg","logo":"/img/logos/tracks/lasvegasmotorspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"lasvegasmotorspeedway-small.jpg","track_id":103,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_vegas/103-vegas-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}