{"coordinates":"35.6958200,-81.2691600","detail_copy":"<p>Before NASCAR's biggest names first shone under the bright lights of Charlotte Motor Speedway, many of them found their first successes elsewhere in North Carolina. The city of Hickory plays home to the World's Most Famous Short Track, Hickory Motor Speedway, a .363-mile asphalt bullring that has welcomed racers and fans through its gates for more than 70 years.</p><p>From its early days since opening in 1951 as a half-mile dirt oval to the current day, Hickory's fastest drivers have had what it takes to win at racing's highest levels. Ralph Earnhardt had five track championships in those early days, while Junior Johnson and Ned Jarrett also scored titles at Hickory early in their Hall of Fame careers. While the track would eventually be reconfigured multiple times before taking its current shape, the quality of names on track remained the same, with legends like Jack Ingram and Harry Gant earning titles of their own later on.</p><p>For much of its history, Hickory played host to what is now known as the NASCAR Xfinity Series, and it even hosted nearly two decades of NASCAR Cup Series racing before the 1972 schedule shift that consolidated the division. Nowadays, it's a premier circuit on the NASCAR Advance Auto Parts Weekly Series map, and a crucial part of multiple Super Late Model series' calendars.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/hickorymotorspeedway","gallery_images":"1,2,3","gallery_prefix":"hickorymotorspeedway-gallery.jpg","large_image":"hickorymotorspeedway-large.jpg","logo":"/img/logos/tracks/hickorymotorspeedway-logo.png","north":"160deg","num_svg_images":8,"small_image":"hickorymotorspeedway-small.jpg","track_id":414,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_hickory/414-hickory/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}