{"coordinates":"30.1345808,-97.6380451","detail_copy":"<p>It can fairly be said that American road racing entered the 21st century with the debut of the Circuit of the Americas as host of the 2012 United States Grand Prix. The first track in the United States designed specfically for Formula One, CoTA (as it is often called) was conceived by promoter Tavo Hellmund and Motorcycle World Champion Kevin Schwantz and designed with the assistance and noted race circuit designer Hermann Tilke.</p> <p>The ambitious CoTA project was revealed in July of 2010 when Hellmund announced plans to build the track on about 900 acres (3.7 km2) of undeveloped land near Austin, TX. With backing from billionaire Red McCombs, plans quickly proceeded. The circuit's design was submitted to the FIA for approval in December of 2010 with construction beginning later that month. The FIA issued its final approval of the circuit in September of 2012 some sixty days before the inaugural Formula One race.</p> <p>The 3.427-mile (5.515 km) Grand Prix circuit features CoTA's signature corner – Turn One, a tight hairpin at the crest of a 133 ft rise - followed by a rapid descent into a series of fast, sweeping corners leading to another hairpin. From there the cars follow a .62 mile straight (1.0 km) before a complex series of multi-apex corners in a stadium-like setting returns the cars to the pit straightaway. The facility also includes a shorter 2.6 mile (4.184 km) National circuit which, like the Grand Prix circuit, runs counter clockwise.</p> <p>In addition to the state-of-the-art circuit, pit and garage facilities, CoTA features impressive spectator and VIP amenities including a 251 feet (77 m) tall observation tower, several stadium grandstand seating sections and spectator mounds for general admission viewing. Along with Formula One, CoTA has hosted the V8 SuperCars Series, MotoGP, the FIA World Endurance Championship, the American Le Mans Series and the GRAND-AM Sports Car Series (now combined into the United SportsCar Championship) as well as various club and vintage events.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/circuitoftheamericas","gallery_images":"1,2,3","gallery_prefix":"circuitoftheamericas-gallery","large_image":"circuitoftheamericas-large.jpg","logo":"/img/logos/tracks/circuitoftheamericas-logo.png","north":"90deg","num_svg_images":6,"small_image":"circuitoftheamericas-small.jpg","track_id":231,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_cota/231-cota-west/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}