{"coordinates":"36.6340671,-79.8538533","detail_copy":"<p>How long has NASCAR been racing at Martinsville Speedway? Since the very beginning. On July 4, 1947 more than 4,000 fans jammed into the one-year-old dirt half-mile race track to watch Fonty Flock beat his brother Tim, Buck Baker and sanctioning body founder Bill France himself in NASCAR's sixth-ever race.</p> <p>The race track that Clay Earles carved out of the Virginia countryside was shaped like a paper clip and just 137 feet more than a half mile in length (.526-mile, to be exact.) Other than an asphalt paving job in 1955 and the addition of more durable concrete lanes in the 12-degree banked corners 21 years later, Martinsville Speedway, the only remaining NASCAR venue from the 1947 season, is the same configuration it was when the gates were first opened. Oh, and then there's the addition of grandstands to increase the seating capacity from the original total of 750 to the 85,000 it boasts today.</p> <p>Now owned by International Speedway Corporation, Martinsville Speedway hosts the NASCAR Sprint Cup Series&#8482;, NASCAR Craftsman Truck Series&#8482;, NASCAR Late Model Stock Car Series&#8482; and the NASCAR Whelen Modified Tour&#8482;. With short, tight, modestly-banked corners, the competition is tight and it can get quite physical. After 500 laps around Martinsville, few, if any of the cars are unmarked. And race winners know they've earned their trophies.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/martinsvillespeedway","gallery_images":"1,2,3,4,5,6,7,8,9","gallery_prefix":"martinsvillespeedway-gallery","large_image":"martinsvillespeedway-large.jpg","logo":"/img/logos/tracks/martinsvillespeedway-logo.png","north":"90deg","num_svg_images":7,"small_image":"martinsvillespeedway-small.jpg","track_id":33,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_martinsville/33-martinsville/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}