{"coordinates":"39.2415229,-77.9778938","detail_copy":"<p>With the hilly but high-speed 2-mile Summit Point track (in full and short versions) and the 1.1-mile highly technical Jefferson Circuit, Summit Point Motorsports Park offers every challenge a road-racer could desire - and then some.</p> <p>Set in the lush West Virginia countryside just over the border from Northern Virginia and less than two hours from Washington, DC, driving any of the Summit Point circuits is like a very fast tour over country roads. Summit Point opened in 1973 and while early in its history the track hosted professional road-racing series, in recent years the focus for the entire facility has been on amateur racing, high-performance driver training and club events.</p> <p>The Summit Point circuit, in either it's long or short configuration, is quite fast and features a 40-foot elevation change. The 2,900-foot pit straight is preceded by a fast right-hander, so speeds are high at the braking point for the acute corner at the end of the straight. Miss your braking point and you'll have a fast trip through tall grass. The fast downhill approach to the tight Wagon Wheel also requires careful and precise braking on the approach and careful throttle modulation all the way around the long corner.</p> <p>The Jefferson Circuit is a great learning tool, with seven turns - lefts, rights, switchbacks and elevation changes - crammed into barely more than a mile of pavement.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/summitpointraceway","gallery_images":"1,2,3","gallery_prefix":"summitpointraceway-gallery","large_image":"summitpointraceway-large.jpg","logo":"/img/logos/tracks/summitpointraceway-logo.png","north":"90deg","num_svg_images":5,"small_image":"summitpointraceway-small.jpg","track_id":24,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_summit/24-summit-summit-short/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}