{"coordinates":"44.0541878,-78.677559","detail_copy":"<p>Canadian Tire Motorsport Park (aka Mosport Park) is one of the world's classic road racing circuits. Designed and built in the late 1950s on the rolling, wooded sandhill country about 50 miles east of Toronto, Canadian Tire Motorsport Park's ten-turn, 2.459 mile track is widely-regarded as one of the most daunting road courses on the planet owing to an abundance of ultra-fast, blind corners, many of which feature dramatic elevation changes. However, the track's signature turn is Moss Corner, a double apex hairpin named in honor of Stirling Moss, who re-designed the corner after seeing its originally-planned configuration.</p> <p>Fittingly, Moss won the first major race held at Mosport (pronounced Moe-Sport as a contraction of the words \"motor\" and \"sport\") in a Lotus 19 in 1961. Canadian Tire Motorsport Park subsequently enjoyed tremendous popularity throughout the 1960s and became the traditional first round of the Can-Am Challenge Series. In 1967 Canadian Tire Motorsport Park staged the first true World Championship Canadian Grand Prix Formula One event, won by Jack Brabham. Together with Quebec's Circuit Mont Tremblant, Canadian Tire Motorsport Park hosted the Canadian Grand Prix on alternate years and, later, served as the event's permanent home from 1972 until the race moved to Montreal's Circuit Gilles Villeneuve in 1978.</p> <p>In addition to Formula One, Canadian Tire Motorsport Park also staged a couple of , USAC Indy car races in the late '60s and, after losing the Canadian Grand Prix to Circuit Gilles Villeneuve, continued to host major motorcycle and sports car races including the IMSA Camel GT and, more recently, American Le Mans Series.</p> <p>Originally a publically-owned venture, Canadian Tire Motorsport Park saw a succession of owners including Norm Namerow and Harvey Huddes before the Panoz Motor Sports Group acquired the facility in 1998. The PMSG widened and repaved the track in 2001 in order to meet FIA specifications although, in contrast to the vast majority of road courses built in the 1950s and '60s still being utilized, Canadian Tire Motorsport Park's basic layout (and character) remains intact.</p> <p>In 1967, Jimmy Clark in his Lotus 49 Ford/Cosworth won the pole for the inaugural Canadian Grand Prix with a lap of 1:22.4. The current track record of 1:04.094 (138.116 mph) was established by Dindo Capello in an Audi R10 TDI in 2008.</p> <p>In addition to the 2.459 mile Grand Prix circuit, Canadian Tire Motorsport Park includes a half-mile paved oval; a 2.4 km advanced driver and race driver training facility with a quarter-mile skid pad (Canadian Tire Motorsport Park Driver Development Centre) and a 1.4 km kart track (Canadian Tire Motorsport Park International Karting).</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/canadiantiremotorsportspark","gallery_images":"1,2,3","gallery_prefix":"canadiantiremotorsportspark-gallery","large_image":"canadiantiremotorsportspark-large.jpg","logo":"/img/logos/tracks/canadiantiremotorsportspark-logo.png","north":"90deg","num_svg_images":10,"small_image":"canadiantiremotorsportspark-small.jpg","track_id":144,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_mosport/144-mosport/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}