{"coordinates":"41.956733,-72.322947","detail_copy":"<p>Today's \"Modified\" traces its lineage back to the very beginning of stock car racing, decades before the advent of current-body style cars made their appearance on race tracks across America. And it was at Stafford Motor Speedway 20 years ago that the Modified Stock Car, seemingly on the road to oblivion, had a rebirth.</p> <p>Racing began at the Stafford Springs Agricultural Park in 1870, but the powerplants propelling the drivers were purely equine until the end of World War II, when Midgets, Sprint Cars and on occasion Stock Cars displaced the horses on the half-mile flat dirt track.</p> <p>In 1959 the management of Stafford Speedway obtained a NASCAR sanction, an arrangement that endures to this day. Track visitors from the south - Lee Petty, Joe Weatherly and Curtis Turner challenged their northern counterparts - Pete Corey, Ernie Gahan, Bill Wimble, Frankie Schneider and a youngster named Eddie Flemke.</p> <p>In 1967 the track was paved, with flat, sweeping turns that put a premium on driving skill. Bugs Stevens, Fred Desarro, Jerry Cook, and Richie Evans all won at Stafford on their way to NASCAR National Modified Championships.</p> <p>In 1969 the Arute family took over management of the facility and in short order made changes that brought Modified racing back from its slide toward extinction. The Arutes encouraged a change in bodywork that did away with the 1930s-era coupe and sedan coachwork and put shells from contemporary cars over the tube-frame chassis. This gave the cars a more modern, up-to-date appearance, one that fans in the grandstands could better identify with. And then, a few years later, the Arutes, alarmed at the accelerating costs of racing, drew up a set of technical rules for something they called the SK Modified. The rules retained the chassis and bodywork of the standard Modified, but reduced the costs for tires and engines, the most expensive aspects of racing.</p> <p>Today, nearly 130 years after racers first competed there, Stafford Speedway is still on the cutting edge of progress. In 1997, a 270,000-watt state-of-the art MUSCO lighting system was installed. And Bose selected Stafford as a research and design facility and maintains an 8,400-watt sound system, so spectators can easily hear the announcer over the roar of the engines.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/staffordmotorspeedway","gallery_images":"1,2,3","gallery_prefix":"staffordmotorspeedway-gallery","large_image":"staffordmotorspeedway-large.jpg","logo":"/img/logos/tracks/staffordmotorspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"staffordmotorspeedway-small.jpg","track_id":11,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_stafford/11-stafford-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}