{"coordinates":"41.981931, -71.825473","detail_copy":"<p>The terms \"Thompson Speedway\" and \"New England motorsports\" are all but synonymous. The track that became known as the \"Indy of the East\" was born of the calamitous hurricane (\"The Long Island Express\") that devastated much of New England in 1938, including the Connecticut farm of John Hoening. Rather than rebuilding his farm, Hoening constructed the country's first paved race track on the site - a 5/8s mile oval with turns banked at 26 degrees.</p> <p>Hoening opened his Thompson International Speedway on May 26, 1940 for a race featuring what are now called sprint cars. Dizzy Vance won the track's debut event for car owner Louis D'Amore before an overflow crowd... and motor racing fans have been flocking to the northeast corner of Connecticut ever since.</p> <p>Following World War II, Thompson became a hotbed of stock car racing. In 1951, the newly-organized National Association for Stock Car Automobile Racing (aka NASCAR) staged a Grand National race at Thompson won by Neil Cole. While the Grand National series (now NASCAR Sprint Cup Series&#8482;) would return on a number of occasions with NASCAR legends like David Pearson and Bobby Issac visiting victory lane, Thompson's weekly racing series would be the springboard for many of stock racing's biggest stars. Daytona 500 winner Pete Hamilton, Talladega 500 winner Ron Bouchard, Pete Sacks, Jimmy Spencer and Geoffrey, Brett and Todd Bodine all cut their teeth at Thompson which has since added a ยบ mile oval to the facility, complimenting the legendary 5/8 mile track.</p> <p>Today, seventy years on from its tumultuous birth, Thompson International Speedway remains in the capable hands of Hoening's son Donald, together with grandson D.R. Theirs continues to be one of the busiest race tracks in the country, running weekly stock car races for Sunoco Modifieds, Super Late Models, Late Models, Thompson Modifieds, Limited Sportsman, Mini-Stocks, Pro Four Modifieds as well as the NASCAR Whelen Modified Series&#8482;.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/thompsonspeedwaymotorsportspark","gallery_images":"1,2,3,4,5,6,7,8,9","gallery_prefix":"thompsonspeedwaymotorsportspark-gallery","large_image":"thompsonspeedwaymotorsportspark-large.jpg","logo":"/img/logos/tracks/thompsonspeedwaymotorsportspark-logo.png","north":"90deg","num_svg_images":6,"small_image":"thompsonspeedwaymotorsportspark-small.jpg","track_id":161,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_thompson/161-thompson/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}