{"coordinates":"35.3511641,-80.6912655","detail_copy":"<p>Opened in 1960 by Bruton Smith and NASCAR driving legend Curtis Turner with the running of the longest stock car race in history, the World 600, the Charlotte Motor Speedway closed before it would ultimately become the home track of so many NASCAR team. Just a year after the first race the 1.5-mile the oval track was in bankruptcy, done in by a huge infield rock formation that ballooned construction costs far beyond what its two founders had forecast.</p><p>Almost 60 years later nearly everything is different. More than 89,000 seats ring the race track, which was the first superspeedway to install lights for night racing; the first race track to incorporate a condominium apartment complex overlooking the racing surface; the first to build an office complex with the same view; the first race track to sell naming rights; and the first to open a year-round club where members can spectate during races and socialize with fellow club members at other times. Everything is very different from 1960 except for one thing: Charlotte Motor Speedway is still owned by Bruton Smith.</p><p>These days Charlotte Motor Speedway is the queen of a publicly-traded motorsports empire controlled by Smith. With the legendary H.A. “Humpy” Wheeler managing the day-to-day operations and promoting the races with flair and imagination, the track was soon among the most successful in the world.</p><p>The Charlotte Motor Speedway built a new infield road course, designed specifically for NASCAR competition, in 2018. It utilizes nearly all of the 1.5 mile oval as well as newly built infield portion – thus the name Roval (Road/Oval).</p><p>The Roval configuration is a 17-turn, 2.28 mile track that challenges the best of drivers and team. Car setups are typically compromises – a car good on the oval may not be so good in the infield and vice versa so drivers and crew chiefs have to decide what matters most to them. Two chicanes, one on the back straight and one just before the start finish line, make for some exciting passing opportunities as competitors can attempt to out brake each other.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/charlottemotorspeedway","gallery_images":"1,2,3","gallery_prefix":"charlottemotorspeedway-gallery.jpg","large_image":"charlottemotorspeedway-large.jpg","logo":"/img/logos/tracks/charlottemotorspeedway-logo.png","north":"160deg","num_svg_images":17,"small_image":"charlottemotorspeedway-small.jpg","track_id":336,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_charlotte_2018/336-charlotte-2018-legendsrclong/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}