{"coordinates":"34.9125856,134.2160527","detail_copy":"<p>Opened in 1990 as one of the world's first - and best - \"country club\" race tracks, Okayama International Circuit was designed largely for the use of wealthy clients looking to exercise their exotic automobiles in the challenging but safe environment of a world class motorsports facility. The circuit (formerly known as TI Circuit Aida) soon staged its first international race featuring veteran British drivers and hosted the Formula One Pacific Grand Prix won by Michael Schumacher and Benetton Racing in 1994 and '95 as well as subsequent World Touring Car Championship events.</p> <p>Okayama International Circuit features two configurations, including the 11 turn, 2.314 mile circuit featured in the Pacific Grand Prix and subsequent major national and international events, as well as a seven turn, 1.3 mile track used primarily for schools and club racing events. In deference to the great British racers who christened the circuit in 1992, Okayama's turns carry names like Hobbs, Moss, Redman and Williams.</p> <p>Owing to its remote location (some 200 miles southwest of Tokyo between Osaka and Hiroshima), Okayama International Circuit no longer stages major international events. However, its world class facilities and technical layout make it a staple on the schedules of Japan's top racing series including the Super Taikyu Series, Super GT Series and Formula Nippon as well as the All Japan Road Racing Championship for motorcycles.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/okayamainternationalcircuit","gallery_images":"1,2,3","gallery_prefix":"okayamainternationalcircuit-gallery","large_image":"okayamainternationalcircuit-large.jpg","logo":"/img/logos/tracks/okayamainternationalcircuit-logo.png","north":"90deg","num_svg_images":5,"small_image":"okayamainternationalcircuit-small.jpg","track_id":167,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_okayama/167-okayama-short/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}