{"coordinates":"33.7643144,-118.1917598","detail_copy":"<p>Born against long odds in 1976, the Long Beach Grand Prix is North America's premier street race. The debut event featured Formula 5000 cars in a race won by Brian Redman. The following year, Clay Regazzoni captured the inaugural U.S. Grand Prix (West) and in 1977 Mario Andretti passed Jody Scheckter in the closing laps to become the first American to win an F1 race on home ground.\nAndretti's popular victory put the race on firm financial footing and set in motion the rebirth of Long Beach, which morphed from a down-on-its heels port city to a thriving modern city/tourist destination. The resulting building boom necessitated ongoing changes to the track layout, finally settling on the current 1.968 mile, 11 turn circuit encircling the Long Beach Convention Center and the Long Beach Aquarium.</p>\n<p>Nor were the changes limited to the track and its environs. The Long Beach GP changed gears in 1984, bringing the home-grown Indy cars to town as the featured attraction. The event hardly missed a beat, as the names of Unser, Zanardi, Montoya, Franchitti and Power soon joined the likes of Regazzoni, Andretti, Villeneuve, Piquet and Lauda on the illustrious list of Long Beach winners. What's more, the event grew to include - at various times - the American Le Mans Series, GRAND-AM Sports Car Series and the Pirelli World Challenge, along with the popular Toyota Celebrity race in which Hollywood's famous (and near famous) exchange Armani and Gucci for Simpson and Bell.</p>\n<p>F1 or IndyCar, world class driver or movie star, the Long Beach Grand Prix circuit is as testing as they come ... with very hard walls eagerly awaiting the slightest mistake.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/longbeachstreetcircuit","gallery_images":"1,2,3","gallery_prefix":"longbeachstreetcircuit-gallery.jpg","large_image":"longbeachstreetcircuit-large.jpg","logo":"/img/logos/tracks/longbeachstreetcircuit-logo.png","north":"160deg","num_svg_images":13,"small_image":"longbeachstreetcircuit-small.jpg","track_id":179,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_longbeach/179-longbeach/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}