{"coordinates":"50.4369118,5.969856","detail_copy":"<p>Circuit de Spa-Francorchamps is one of the motorsport world's most storied venues. The home of the Belgian Grand Prix, the 24 Hours of Spa and the Spa 1000K, Circuit du Spa-Francorchamps -- aka Spa - has long been recognized as a supreme test of courage and skill. Spa's roll call of winning drivers reads like a history of Grand Prix and sports car racing: Michael Schumacher; Pedro Rodriguez; Jimmy Clark; Jo Siffert; Jacky Ickx; Henri Pescarolo; Juan Manuel Fangio; Ayrton Senna; Dan Gurney; Alberto Ascari.</p> <p>Spa has seen many variations over the years. Designed in 1920, the circuit originally ran for some 15km over public roads in Belgium's Ardennes region, connecting the hamlets of Francorchamps, Malmedy and Stavelot near the resort of Spa. The elimination of a hairpin turn in the valley of Eau Rouge creek later shortened the circuit by about a kilometer and added to its already fearsome speeds. For while Spa lacked the long straightaways of Le Mans, Monza or Reims, with the exception of the famed La Source hairpin, it was comprised exclusively of fast, sweeping curves where speeds seldom fell below 100 mph.</p> <p>Those speeds peaked in the early 1970s, when Rodriguez won the 1970 Belgian Grand Prix at an average speed of 149.941 mph and Henri Pescarolo set a lap record of 163.086 mph during the 1973 Spa 100K. Owing to safety concerns, the circuit was reconfigured to its current 7 km (4.352 mile) layout in the 1980s. The revised circuit retains much of the flavor of the original course and, indeed, many of its signature turns including La Source, Blanchimont and the daunting Eau Rouge. As well, the \"new\" Spa features a demanding, purpose-built section that sweeps down a valley through the fast Pouhon curve and the Campus esse bend before rejoining the \"old\" circuit near Blanchimont.</p> <p>The result is among the most challenging tracks on the current Formula One and sports car racing schedule. But don't take our word for it. Ask the only seven time world champion driver:</p> <p>\"It is without doubt the best circuit in the world,\" says Schumacher. \"The kind of atmosphere you get at Spa is something akin to the old Nurburgring. It is the only place which still has this quality and atmosphere. Eau Rouge is really the most tremendous corner. It is like flying downhill and seeing a big mountain in front of you. You get the feeling that you are driving into the road and then you go up and it is a sensation which is probably the best you can experience and the most satisfaction you can have as a racing driver.\"</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/circuitdespafrancorchamps","gallery_images":"1,2,3","gallery_prefix":"circuitdespa-francorchampsgallery","large_image":"circuitdespafrancorchamps-large.jpg","logo":"/img/logos/tracks/circuitdespafrancorchamps-logo.png","north":"90deg","num_svg_images":10,"small_image":"circuitdespafrancorchamps-small.jpg","track_id":164,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_spa/164-spa-low/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}