{"coordinates":"38.6507543,-90.1375489","detail_copy":"<p>Located in the shadow of the Gateway Arch, Gateway Motorsports Park’s roots date back to the 1960s when what was known as St Louis Raceway Park consisted of a 1/8 mile drag strip. In the 1980s the drag strip was lengthened to ¼ mile, a 2.6 mile road course was added and the facility was renamed Gateway International Raceway. The track was acquired in 1995 by Dover Motorsports Inc. which constructed a 1.25 mile, egg-shaped oval and 1.65 mile road course utilizing the infield and Turns 3 and 4 of the oval. Although Gateway hosted IndyCar, NHRA and NASCAR Nationwide and Truck events, Dover Motorsports closed the track in 2010. Real estate developer Curtis Francois subsequently acquired the facility, rechristened it Gateway Motorsports Park and inked agreements with the NHRA and NASCAR.</p> <p>Likened to Phoenix and Darlington, Gateway’s asymmetrical oval has proven to be a demanding test of driver and machine, regardless of whether those machines are open wheel or stock cars. With Turns 1 and 2 tighter, but more steeply banked than Turns 3 and 4, the track requires a compromise chassis set-up, while the fact that the list of Gateway race winners includes names like Carl Edwards, Ron Hornaday and Juan Pablo Montoya attests to the demands it places on drivers.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/worldwidetechnologyraceway","gallery_images":"1,2,3","gallery_prefix":"worldwidetechnologyraceway-gallery","large_image":"worldwidetechnologyraceway-large.jpg","logo":"/img/logos/tracks/worldwidetechnologyraceway-logo.png","north":"90deg","num_svg_images":9,"small_image":"worldwidetechnologyraceway-small.jpg","track_id":237,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_gateway/237-gateway-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}