{"coordinates":"45.621799,9.282606","detail_copy":"<p>Known to racing aficionados and car buffs alike simply as \"Monza,\" the Autodromo Nazionale Monza is among the most fabled motor racing circuits in all the world. Constructed in Monza’s Royal Villa park in the early 1920s, the circuit has hosted the Italian Grand Prix Formula One race every year but one since the series’ inception and holds the record for the fastest (153.842mph/247.585kph) and closest finish (.18s covering the top four) in Formula One history in 2003 and 1971, respectively. While its storied history (and proximity to Ferrari’s headquarters in Maranello) makes Monza the unchallenged home of Italian Formula One racing, the facility has played host to virtually every form of motorsports over the years, from sports prototypes, GTs and touring cars, to Moto GP and superbikes. Monza even hosted the legendary Race of Two Worlds in 1957-58, which pitted Indianapolis-style race cars against Formula One cars. Thus the breadth of Monza’s roll call winners is unparalleled, from Tazio Nuvolari and Amedeo Ruggeri to Juan Manuel Fangio, Jimmy Bryan, John Surtees, Michael Schumacher and Sebastian Vettel, who earned the first F1 win of his career in the 2008 Italian Grand Prix.</p> <p>Monza has three very different tracks – the 3.6 mile (5.793K) Grand Prix circuit, the 1.494 mile (2.4K) Junior circuit and the Alta Velocita, a steeply-banked 2.6 mile (4.25K) oval. Although a combination of the Grand Prix circuit and Alta Velocita was used in Formula One races in the 1950s, the practice was discontinued owing to the ferocious pounding the bumpy oval meted out to cars and drivers alike. As well the Grand Prix circuit has undergone a number of safety-targeted modifications over the years, including the addition of the Variante del Rettifilo, Variante della Roggia and Variante Ascari chicanes, but the boomerang-shaped circuit’s fundamental high speed character remains unchanged.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/autodromonazionalemonza","gallery_images":"1,2,3","gallery_prefix":"autodromonazionalemonza-gallery","large_image":"autodromonazionalemonza-large.jpg","logo":"/img/logos/tracks/autodromonazionalemonza-logo.png","north":"90deg","num_svg_images":13,"small_image":"autodromonazionalemonza-small.jpg","track_id":242,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_monza/242-monza-nochicane/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}