{"coordinates":"37.0866696,-76.3888498","detail_copy":"<p>Langley Speedway is among the most historic - and busiest - race tracks in America. Immediately adjacent to NASA's Langley Research Center in Hampton, VA, the relatively flat, .395 mile asphalt oval has been the launching pad for many NASCAR careers including those of Denny Hamlin and Elliott Sadler, and was the site of nine NASCAR Grand National races won by the likes of Ned Jarrett, Bobby Isaac, Bobby Allison, David Pearson and, of course, Richard Petty.</p> <p>Langley's heritage dates to the 1940s when the property was the site of an 8/10 mile dirt horse race track known as the Dude Ranch. The track owners occasionally promoted auto races at the track and, by the 1950s, realized the auto races attracted bigger crowds than the horse races. They shortened the track to its current length and eventually sold the facility to Harry Kilch in 1963. Kilch immediately set about making improvements to the rough and tumble track and hosted NASCAR Grand National Series events between 1964 and 1970. Langley was paved in 1968 and, two years later, hosted the final Grand National race before the series was renamed the Winston Cup.</p> <p>Today, under the ownership of former racer/area businessman Bill Mullis, Langley Speedway hosts a variety of NASCAR-sanctioned series including the Whelen All-American Series. The track currently hosts 11 divisions which alternate running during their Saturday night program: Late Models, Grand Stock, Modifieds, Legends cars, Super Street, UCAR, Pro Six, Super Trucks, HRKC Pro Winged Champ Karts, and Enduros.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/langleyspeedway","gallery_images":"1,2,3","gallery_prefix":"langleyspeedway-gallery","large_image":"langleyspeedway-large.jpg","logo":"/img/logos/tracks/langleyspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"langleyspeedway-small.jpg","track_id":201,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_langley/201-langley/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}