{"coordinates":"39.4754000,-86.1358000","detail_copy":"<p>The first motorsports competition at the Indianapolis Motor Speedway took place in 1909 in form of motorcycle races and automobile races soon followed. When the track's original surface of crushed stone and tar proved problematic, the owners paved the track with more than 3 million bricks, giving rise to its nickname: \"The Brickyard.\"</p><p>\r\nIt wasn't until Memorial Day of 1911, however, that the first 500 mile race was held at the Indianapolis Motor Speedway and won by Ray Harroun in his Marmon Wasp. What quickly became known as the Indianapolis 500 became one of the nation's leading sports events in the 1920s and '30s. To win the \"Indy 500\" was to achieve instant notoriety, and the names of early winners like Tommy Milton, Louis Meyer and Wilbur Shaw are indelibly etched in the annals of American motorsports.</p><p>\r\nA nationwide ban on motorsports during World War II, however, nearly spelled the end for the Indianapolis Motor Speedway, which lay in virtual ruin when a consortium headed by Indiana businessman Tony Hulman purchased the facility in 1945. Hulman and his partners invested heavily in the facility and expanded the spectator capacity to the point that the Indianapolis Motor Speedway became the world's largest sporting arena (in terms of permanent seats) and the Indy 500 the world's largest single-day sports event with crowds regularly topping 350,000. The march of progress also included the gradual process of paving-over the bricks with a modern asphalt surface. By 1961 the resurfacing had been completed – leaving just the famous \"yard of bricks\" at the start/finish line as a tribute to the tradition of \"The Brickyard.\"</p><p>\r\nThe 1990s saw major changes to the Speedway. In 1994, IMS president Tony George (grandson of Tony Hulman) consummated an agreement with NASCAR to stage a stock car race - the Brickyard 400 - at the Speedway. Then in 2000, George brought Formula One racing back to the , USA after a nine-year absence, staging the U.S. Grand Prix at the Indianapolis Motor Speedway.</p><p>\r\nTo do so, however, required a massive renovation of the facility, including the construction of a 2.605-mile road course that combined a portion of the oval with a twisting infield section. Although the F1 race would only last through 2007, its place was been taken by Moto GP, enabling the Indianapolis Motor Speedway to return to its motorcycle roots. Beginning in 2014, the road course will also host the Grand Prix of Indianapolis IndyCar race as the kick-off to a month of May concluding with the Indianapolis 500 on its traditional Memorial Day weekend date.</p><p>\r\nAs of 2022, iRacing's version of Indianapolis Motor Speedway has been updated with all-new scans of the oval and road course added to the original configurations.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/indianapolismotorspeedway","gallery_images":"1,2,3","gallery_prefix":"indianapolismotorspeedway-gallery","large_image":"indianapolismotorspeedway-large.jpg","logo":"/img/logos/tracks/indianapolismotorspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"indianapolismotorspeedway-small.jpg","track_id":453,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_indianapolis/453-indianapolis-2022-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}