{"coordinates":"33.3748700,-112.3134150","detail_copy":"<p>Opened in 1964, Phoenix Raceway was built with one thing in mind: becoming the home for open-wheel racing in the western half of the United States. It quickly accomplished that, hosting IndyCar races for more than 40 consecutive years and later adding the Copper World Classic for Silver Crown and midget cars in 1977. From there, it was only a matter of time until NASCAR brought the Cup Series there for the first time in 1988; Alan Kulwicki's first career win came in that race, and he celebrated with the reverse \"Polish Victory Lap\" that many drivers still utilize today. The track also hosted the first-ever NASCAR Truck Series event in 1995.</p>Through its history, Phoenix's one-mile oval has always been defined by its asymmetrical turns and dogleg, which was implemented in part because of the natural terrain of the area. With different progressive banking at each end of the track as well, Phoenix is often a favorite track of drivers for the challenges that they face in setting up their cars and maximizing their performance.</p>Although its backstretch dogleg already made it one of the most unique ovals in America, the track's latest renovation, which was completed in October 2018, made it even more unique. The start-finish line was moved between the former Turn 2 and the dogleg, fundamentally changing how drivers would approach each lap, while the former front-stretch grandstand was removed in favor of expanding seating closer to the new start-finish line. The shift also led to a reconfiguration of pit road. This layout made its NASCAR Cup Series debut in November 2018, and began hosting NASCAR's championship weekend with the 2020 season.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/phoenixraceway","gallery_images":null,"gallery_prefix":null,"large_image":"phoenixraceway-large.jpg","logo":"/img/logos/tracks/phoenixraceway-logo.png","north":"90deg","num_svg_images":14,"small_image":"phoenixraceway-small.jpg","track_id":418,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_phoenix_2021/418-phoenix-2021-oval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}