{"coordinates":"50.9904979,5.25579","detail_copy":"<p>Belgium's \"other\" world class motorsports facility, Circuit Zolder has long played second fiddle to the iconic Circuit de Spa-Francorchamps. That's unfortunate, because Circuit Zolder is an exciting and historic race track in its own right.</p> <p>Although today's circuit was built in 1963, motor racing in the area dates to the 1950s when the local Zolder motor club organized races around the town square. The short Omloop van Terlaemen was built in 1961 and two years later (under the direction of noted race track designer Hans Hugenholz) was expanded to the basic layout of today's 2.492 mile (4.011 km) Circuit Zolder. Although the original circuit’s succession of hair-raising sweeps and long straightaways has been modified for safety purposes, Circuit Zolder remains a fast and challenging track that nearly encircles a canal at one end and a forested motorhome park on the other!</p> <p>Circuit Zolder hosted the Belgian Grand Prix ten times in the 1970s and '80s, including the 1978 race debut of the Lotus 79 when Mario Andretti sat on pole by more than 1.5s. Sadly, Zolder was also the scene of Gilles Villeneuve’s fatal accident during qualifying for the 1982 Belgian Grand Prix.</p> <p>More recently, Circuit Zolder has hosted a variety of top flight events including the FIA GT Series, the Champ Car World Series, the Belgian Moto GP and the 24 Hours of Zolder.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/circuitzolder","gallery_images":"1,2,3","gallery_prefix":"circuitzolder-gallery","large_image":"circuitzolder-large.jpg","logo":"/img/logos/tracks/circuitzolder-logo.png","north":"90deg","num_svg_images":4,"small_image":"circuitzolder-small.jpg","track_id":199,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_zolder/199-zolder-gp/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}