{"coordinates":"42.3382811,-76.9285517","detail_copy":"<p>Just south of Seneca Lake, amidst the rolling vineyards and woodlands in Upstate New York's Finger Lakes region, sits a shrine of American motorsport. Watkins Glen International is more than just a racetrack. It is the birthplace of post-war road racing in North America, a worthy test of some of the best drivers to ever sit in a racecar.</p> <p>Today, The Glen hosts the NASCAR Sprint Cup Series&#8482; and NASCAR Nationwide Series&#8482;, as well as the Indy Racing League, Grand-Am Rolex Sports Car Series&#8482;, Sports Car Club of America professional and amateur racing, and a major vintage race meet.</p> <p>Over the years The Glen has been lengthened once and continually upgraded. Four different configurations of the track are available to iRacing members, and a lap around today's Grand Prix circuit still incorporates much of the original layout. The first turn is known as \"The 90,\" a right-hander and a good place to pass. Then it's up toward \"The Esses,\" a series of three fast, sweeping apexes leading onto the back straight. The cars reach their top speed here, before hard braking for the bus stop at the end of the straight. Here, the track deviates from its original circuit for \"The Boot,\" a hammerhead-shaped up-and-downhill section of track added in 1971. Turn 9, where The Boot rejoins the original circuit, is another fairly quick lefthander, tricky because it's off camber, followed by the even quicker Turn 10, an almost flat-out left-hander. The last corner (Turn 11) is another fast right-hander that leads out onto the front straight.</p> <p>Racing first came to The Glen in 1948 in the form of the Watkins Glen Grand Prix, an SCCA-sanctioned event that ran on a six and a half mile course over the back roads of the town. The success of that event eventually led to the construction of a permanent track, the resulting product a little more than a third in length of the original street course. In 1957, the track hosted its first race, a NASCAR Grand National Series&#8482; event won by Buck Baker over Fireball Roberts. The following year, Formula Libre showed up, and, not long after that, Watkins Glen hit the big time.</p> <p>In 1961, Formula One came to the little town by the lake, bringing with it some of the most legendary names in motor sports. For the next two decades, the home of the U.S. Grand Prix was Watkins Glen. The early eighties saw some tough times for The Glen. Formula One held its last race there in 1980, but the track would recover soon enough. In 1986, NASCAR's top series returned to The Glen, and with it, a whole new renaissance for the track began.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/watkinsgleninternational","gallery_images":"1,2,3","gallery_prefix":"watkinsgleninternational-gallery","large_image":"watkinsgleninternational-large.jpg","logo":"/img/logos/tracks/watkinsgleninternational-logo.png","north":"90deg","num_svg_images":6,"small_image":"watkinsgleninternational-small.jpg","track_id":109,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_watkinsglen/109-watkinsglen-classic/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}