{"coordinates":"34.0888203,-117.5026942","detail_copy":"<p>Auto Club Speedway is the premier motorsports facility in Southern California. Built on the site of a former Kaiser Steel mill near in Fontana in 1996-97 at a cost of $100m, the track has 84,000 permanent seats and is home to a NASCAR Sprint Cup and Nationwide Series race each spring. As well, Auto Club Speedway has played host to virtually every top level professional motorsports series in North America and is home of both world’s closed course speed record (established when Gil de Ferran qualified for the pole at the 2000 California 500 with a one lap average speed of 241.428 mph) and the fastest circuit race (the 2003 California 400 won by Sam Hornish, Jr at an average speed of 207.151 mph)</p> <p>Constructed by the Penske Corporation as “clone” of Michigan International Speedway, the track was originally known as California Speedway. It was later purchased by the International Speedway Corporation, which subsequently sold its naming rights to the Automobile Club of Southern California for ten years in 2008.</p> <p>In addition to a high-banked oval, Auto Club Speedway features several road course configurations which have been used for sports car and motorcycle races, as well as an infield track used for testing purposes. Given its proximity to Hollywood, the track has also appeared in scores of movies television shows and commercials.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/autoclubspeedway","gallery_images":"1,2,3","gallery_prefix":"autoclubspeedway-gallery","large_image":"autoclubspeedway-large.jpg","logo":"/img/logos/tracks/autoclubspeedway-logo.png","north":"90deg","num_svg_images":6,"small_image":"autoclubspeedway-small.jpg","track_id":227,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_california/227-california-moto/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}