{"coordinates":"35.3089728,-80.5236159","detail_copy":"<p>Located in the heart of NASCAR country, Concord Speedway features two adjacent oval tracks. The larger track, which has grandstand seating for 8,500 spectators, bills itself as the \"World's Fastest Half-Mile Tri-Oval\" and it really is a sort of mini Pocono, with three very distinct turns. With different radii and banking (14 degrees for Turn One, 11 degrees for Turn 2 and 14 degrees for Turn Three) for each turn and straightway (eight degrees for Start/Finish, 10 degrees for the short chute that connects Turns One and Two, and 11 degrees for the back straight) chassis setup is critical for achieving good lap times and a car that is drivable in traffic.</p> <p>First opened in 1982 as a \"short\" (.4-mile) dirt oval, owner Henry Furr five years later paved the track, at the same time lengthening it to a full half-mile with the addition of the third turn in place of the original backstretch. The track had seating for over 12,000 fans prior to a recent downsizing that saw the turn one grandstands converted to a dirt berm.</p> <p>A quarter-mile, conventional two-turn oval, originally dirt but also now paved, sits adjacent to the tri-oval. The smaller track has its own grandstand that accommodates 2,000 spectators.</p> <p>In addition to both Super and Limited Late Model Stock Cars the tri-oval is host to a pair of Hooters Cup races each season. The quarter-mile oval is home to both INEX Legends and Bandolero divisions.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/concordspeedway","gallery_images":"1,2,3,4,5,6,7,8","gallery_prefix":"concordspeedway-gallery","large_image":"concordspeedway-large.jpg","logo":"/img/logos/tracks/concordspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"concordspeedway-small.jpg","track_id":15,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_concordhalf/15-concordhalf/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}