{"coordinates":"34.0142570,-118.2878750","detail_copy":"<p>More than 100 years ago, one of the United States' most iconic sporting venues was commissioned as a memorial to veterans of World War I. Since then, the Los Angeles Memorial Coliseum has hosted just about every event imaginable, from the Summer Olympics (three times as of 2028, which will become a record for any facility at that time) to the Super Bowl, and has served as the home stadium for numerous professional and college sports teams in football, baseball, soccer, and rugby. The stadium has even hosted dozens of major off-road motorsport events, with trucks and cars jumping in and out of the Coliseum entrance every lap.</p> <p>In 2022, NASCAR became the latest major league sport to join the venue's legacy with the Busch Light Clash at the Coliseum. A quarter-mile circuit constructed within stadium walls will see the annual preseason all-star race of the NASCAR Cup Series leave Daytona for the first time. The track was designed and tested by iRacing in cooperation with NASCAR in advance of the unique event, with top real-world and sim racing pros all logging countless laps before both its release on iRacing and real-world debut. The change in venue also leads to a change in format, with qualifying heats to build the feature grid in a manner similar to a local short track race.</p> <p>Now's your chance to take the wheel in a unique part of NASCAR history in one of America's most iconic sporting venues. See if you've got what it takes to conquer the Coliseum quarter mile!","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/lacoliseumraceway","gallery_images":null,"gallery_prefix":null,"large_image":"lacoliseumraceway-large.jpg","logo":"/img/logos/tracks/lacoliseumraceway-logo.png","north":"90deg","num_svg_images":11,"small_image":"lacoliseumraceway-small.jpg","track_id":437,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_lacoliseum/437-lacoliseum/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}