{"coordinates":"44.3443574,11.717198","detail_copy":"<p>The Autodromo Internazionale Enzo e Dino Ferrari – commonly known as Imola in deference to the nearby Italian town – is named for the founder of Ferrari and his son (Dino) who died in 1956.   Located 50 miles east of the Ferrari factory in Maranello, Imola is considered Ferrari’s home circuit and has hosted the Italian Grand Prix and, more often, the San Marino Grand Prix as well as numerous top flight sports car, motorcycle and even bicycling events.</p><p>Constructed in 1953, Imola was originally a terrifically fast circuit with a series of relatively gentle bends and curving straightaways linking the slow Rivazza and Tosa corners interrupted only by the Piratella and Aqua Minerale.   One of a very few international circuits run in a counterclockwise direction, Imola retained its original configuration until 1972 when a series of chicanes was added in order to improve safety.  The track has since undergone frequent and regular updates and now features a challenging mix of straightaways, high speed curves, medium and slow chicanes in its 17 turn, 4.9km/3m layout.</p><p>Imola has been the scene of triumph, tragedy and controversy.  It was here that Didier Pironi disregarded team orders and passed Gilles Villeneuve in the closing laps of the 1982 San Marino Grand Prix and, of course, Imola will forever be remembered for the weekend of the 1994 San Marino Grand Prix in which Roland Ratzenberger and triple world champion Ayrton Senna lost their lives.  But Imola has also been the stage for some of Formula One’s greatest moments, including Patrick Tambay’s emotional victory following Villeneuve’s death and when a young Fernando Alonso stamped himself as a future world champion by defeating Michael Schumacher to win the 2005 San Marino Grand Prix.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/autodromointernazionaleenzoedinoferrari","gallery_images":null,"gallery_prefix":null,"large_image":"autodromointernazionaleenzoedinoferrari-large.jpg","logo":"/img/logos/tracks/autodromointernazionaleenzoedinoferrari-logo.png","north":null,"num_svg_images":9,"small_image":"autodromointernazionaleenzoedinoferrari-small.jpg","track_id":267,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_imola/267-imola-moto/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}