{"coordinates":"36.5156940,-82.2591607","detail_copy":"<p>Bristol Motor Speedway bills itself as the \"World's Fastest Half-Mile\", and despite straightaways barely 200 yards long, it is a very fast racetrack. The secret is in the variable banking in the 300-yard wide-open corners - you may not have much room to accelerate off one corner before shutting down for the next, but with steep banking (up to 30 degrees) there's not much loss of speed when you get there. And the all-concrete racing surface provides great traction.</p><p>\r\nWith 160,000 seats, arrayed in grandstands all the way around the racing surface, Bristol looks more like a football stadium on steroids than a typical race track. Veteran drivers have described racing at this East Tennessee speed emporium as the equivalent of \"flying a fighter plane in a gymnasium,\" so it's not surprising that every NASCAR Cup Series race draws a massive crowd. Still, the best seat in the house is the one behind the wheel. But it's sure not a relaxing one, with laps at racing speeds ticking by at barely more than 15 seconds. Oh, and the compact nature of the track means that there are infield pits on both the front and rear straightaways, so drivers have that added complication to deal with. At the conclusion of a 500-lap NASCAR Cup Series race, not a single car makes it back to the garage without at least a few bumps, scrapes or other battle bruises. And the drivers aren't in much better shape.</p><p>\r\nOpened for competition in 1961, Bristol Motor Speedway has had a number of remodels over the years, and several owners as well. It has been under its current owner, Speedway Motorsports, that Bristol Motor Speedway has enjoyed its greatest period of growth. The track hosts events for all three of NASCAR’s national series and the ARCA Menards Series, and as of 2021, once again goes through a dirt makeover in the spring to welcome World of Outlaws events as well as the Cup Series’ only dirt race.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/bristolmotorspeedway","gallery_images":"1,2,3,4,5,6,7,8,9","gallery_prefix":"bristolmotorspeedway-gallery","large_image":"bristolmotorspeedway-large.jpg","logo":"/img/logos/tracks/bristolmotorspeedway-logo.png","north":"90deg","num_svg_images":5,"small_image":"bristolmotorspeedway-small.jpg","track_id":442,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_bristol/442-bristol-dirt-2022/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}