{"coordinates":"36.560008,-79.2048","detail_copy":"<p>A motorsports Lazarus, Virginia International Raceway is a race track that came back from the dead. Born in 1957 during the initial blitz of U.S. road-racing circuit development, VIR was one of the major sports car racing facilities during the 1960s. Cobra legend Carroll Shelby won the inaugural race behind the wheel of a Maserati 450 S, and over the years races at VIR produced fields populated by sports car stars Carl Haas, Bob Holbert, Augie Pabst, Bob Grossman, Don Yenko, Dick Thompson, Walt Hansgen and Bruce Jennings and NASCAR legends such as Richard Petty, David Pearson, Curtis Turner and Wendell Scott (the latter hailing from nearby Danville, Va.)</p> <p>The track hosted SCCA Trans Am and IMSA endurance races (the first two of which were won by Porsche teammates Peter Gregg and Hurley Haywood), but with its remote location, far from the population centers that fill the spectator areas, VIR experienced financial problems and closed in 1974. Suddenly silent, the facility reverted to farm land.</p> <p>The 1,200-acre parcel still would be farmland today had New York real-estate developer and vintage racer Harvey Siegel not purchased it in 1998 and undertaken the herculean task of not only restoring the circuit, but bringing it up to world-class standards. While retaining the backbone of the original circuit, including its trademark Oak Tree turn, Siegel widened the track to 40 feet and gave it modern safety and convenience features. Today, VIRginia International Raceway (as it now bills itself) offers six configurations (Full Course - 3.27 miles; North Course - 2.25 miles; South Course - 1.65 miles; Patriot Course - 1.1 miles; Grand West - 3.97 Miles; and Grand East - 4.07 miles) of which 2 can always be run simultaneously.</p> <p>All of the courses are challenging, but the 3.27-mile Full Course, the track's original configuration, is a true classic. Straightaways of 3,000 and 4,000 feet yield terrific velocities for any race car, while a 130-foot elevation change adds more dimension to a driver's lap.</p> <p>And while the modern iteration of this classic road-racing facility focuses on amateur events, in addition to NASA amateur sports car events, SCCA national and regional club races, SVRA and HSR vintage competition, VIR hosts AMA motorcycle racing, Grand-Am Rolex Sports Car Series&#8482; and the Grand-Am KONI Challenge Series&#8482;. Today, with the tremendous population growth in Raleigh and Greensboro, just an hour's drive from the track, professional racing at VIR draws more than respectable crowds.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/virginiainternationalraceway","gallery_images":"1,2,3","gallery_prefix":"virginiainternationalraceway-gallery","large_image":"virginiainternationalraceway-large.jpg","logo":"/img/logos/tracks/virginiainternationalraceway-logo.png","north":"90deg","num_svg_images":6,"small_image":"virginiainternationalraceway-small.jpg","track_id":5,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_virginia/5-virginia-east/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}