{"coordinates":"52.3877081,4.5420188","detail_copy":"<p>Circuit Zandvoort ranks among the most historic and challenging road courses in all of Europe. Home of the Dutch Grand Prix from 1952 to 1985, and again since 2021, Zandvoort features a testing blend of straightaways, tight, medium and high-speed turns that run over and around the sand dunes just a few hundred yards from the North Sea.</p> <p>Designed by John Hugenholtz, the Zandvoort circuit opened in 1948. The 2.6 mile road course, located west of Amsterdam, boasted a couple of signature corners, including the fast and undulating Scheivlak, and Tarzanbocht a slightly-banked 180 degree turn at the end of the long pit straightaway. Coupled with the heavy braking at the end of the straightaway, the modest banking encouraged overtaking maneuvers, the most famous of which resulted in Mario Andretti and James Hunt banging wheels during the 1977 Dutch Grand Prix.</p> <p>Over the years, Zandvoort witnessed many classic races. In 1959 Jo Bonnier scored B.R.M's first Formula One victory there. Eight years later the legendary Ford Cosworth DFV earned a famous win in its competition debut in the hands of Jimmy Clark, one of four Dutch Grand Prix wins for the Scotsman. The rain-swept '71 Dutch Grand Prix featured a showdown between the two great rainmeisters of the day - Jacky Ickx and Pedro Rodriguez - that was ultimately resolved in the Belgian's favor. A partial list of Ickx' fellow Dutch GP winners includes Alberto Ascari, Juan Manuel Fangio, Stirling Moss, Jack Brabham, Jimmy Clark, James Hunt, Alan Prost and Niki Lauda.</p> <p>Following the 1985 Dutch Grand Prix the circuit closed owing to financial problems. It reopened four years later as Circuit Park Zandvoort and featured an abbreviated (1.6 mile) version of the original track for use in club racing. In 1995, however, the Dutch government gave the CPZ the go-ahead to develop a new international level circuit. The resulting facility opened in 2001, featuring a modern pit complex as well as the old Tarzanbocht and the new Arie Luyendyk-bocht, which honors the two-time Indianapolis 500 winner who cut his racing teeth at Zandvoort.</p> <p>The contemporary Circuit Zandvoort boasts four different configurations ranging in length from 2.64 to .87 miles. It was reconfigured and brought up to modern standards in anticipation of hosting the Dutch Grand Prix once again in 2020, though the COVID-19 pandemic postponed that for a year. In addition to a full slate of amateur and club races, Circuit Zandvoort annually hosts rounds of national and international sports car races. The iRacing package of Circuit Zandvoort includes both the current version of the track, reflecting its FIA Grade 1 status, and iRacing’s original scan, which features five layouts.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/circuitparkzandvoort","gallery_images":"1,2,3","gallery_prefix":"circuitparkzandvoort-gallery","large_image":"circuitparkzandvoort-large.jpg","logo":"/img/logos/tracks/circuitparkzandvoort-logo.png","north":"90deg","num_svg_images":11,"small_image":"circuitparkzandvoort-small.jpg","track_id":488,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_zandvoort/488-zandvoort-2023-oostelijk/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}