{"coordinates":"33.0373257,-97.2843123","detail_copy":"<p>Everything is bigger in Texas - and that includes race tracks. The 1.5-mile oval of Texas Motor Speedway is home to everything from NASCAR's top three classes and the open-wheelers of the IndyCar Series to Legends Cars.</p> <p>Located on the north side of Fort Worth, the construction of Texas Motor Speedway began in spring of 1995 and required the movement of more than four million cubic yards of earth before it was completed the following year. The oval originally featured unique dual-angle banking and its first major race, a NASCAR Nationwide Series™ event in April, 1997, was won by Mark Martin. Jeff Burton captured the first NASCAR Sprint Cup Series™ race the following day, in front of a sell-out crowd of over 200,000. Two months later, Kenny Irwin won the first NASCAR Camping World Truck Series™ race held at TMS. The track has been good to Dale Earnhardt, Jr.; he won his first ever NASCAR Nationwide Series™ race there in 1998, and then two years later, won his first NASCAR Sprint Cup Series™ race. Shortly after Earnhardt's NASCAR Nationwide Series™ win, the oval was reconfigured, eliminating the eight-degree section of the dual-angle banking.</p> <p>While the IndyCars have developed a reputation for close and sometimes spectacular racing at Texas Motor Speedway over the past decade, in 2001 CART's Champ Cars single visit to the speedway demonstrated that cars can sometimes be just too fast for a venue. Kenny Brack won the pole at a sizzling 233  mph, but before the green flag could wave the following day, the race was cancelled when all but two of the drivers experienced disorientation or dizziness due to sustained g-loading on the banking.</p> <p>iRacing's virtual version of TMS includes a total of six configurations, from the big 24-degree-banked quad oval to the pit-lane-and-front-stretch short oval that plays host to Legends Car races; plus a total of four road-course layouts - the 2.28-mile primary circuit that includes most of the big oval, and three smaller infield-only courses.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/texasmotorspeedway","gallery_images":"1,2,3","gallery_prefix":"texasmotorspeedway-gallery","large_image":"texasmotorspeedway-large.jpg","logo":"/img/logos/tracks/texasmotorspeedway-logo.png","north":"90deg","num_svg_images":6,"small_image":"texasmotorspeedway-small.jpg","track_id":120,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_texas/120-texas-legendsoval/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}