{"coordinates":"43.79751,-87.992157","detail_copy":"<p>Located outside the picturesque village of Elkhart Lake, in Wisconsin's beautiful Kettle Moraine region, an hour north of Milwaukee and just two hours from Chicago, Road America opened in 1955. From 1950 through 1953 the town had been host to annual sports car races conducted on ad-hoc circuits made up of linked sections of county highways, but safety concerns ended open-road racing. The track was built by local civil engineer Cliff Tufte, who set out a 14-turn, four-mile ribbon of pavement, literally over hill and dale. Tufte took advantage of the hillsides adjacent to many parts of the track to provide natural viewing areas for spectators.</p> <p>Road America, one of the world's classic road-racing venues, has been host to every important North American racing series, beginning with SCCA sports cars in the 1950s, to the Can-Am and Trans-Am in the '60s and '70s, IMSA's GT and GTP cars since the '70s, and Indy cars beginning in 1982. NASCAR even ran a race at Road America, back in 1956, won by the legendary Tim Flock. The June Sprints, put on annually for more than 50 years by the SCCA's Chicago Region, draws 600  amateur sports car racers and as many as 30,000 spectators. The current schedule also includes vintage and motorcycle racing.</p> <p>One of the unique aspects of Road America is that it is beloved both by spectators, who are afforded a variety of spectacular views and by drivers, who value the challenges the track presents. And while Road America enjoys a rich tradition, it is not a prisoner of its history. A recent upgrade to the facility saw spectator viewing and paddock access improved by the replacement of the Bill Mitchell bridge with a tunnel a hundred yards further down the road. A further nod to the performance gains wrought by modern technology is the addition of an optional chicane at Road America's famous \"kink\" in the back straightaway, providing a second configuration for race series that don't wish to expose their drivers to one of motorsport's biggest thrills every four miles.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/roadamerica","gallery_images":"1,2,3","gallery_prefix":"roadamerica-gallery","large_image":"roadamerica-large.jpg","logo":"/img/logos/tracks/roadamerica-logo.png","north":"90deg","num_svg_images":8,"small_image":"roadamerica-small.jpg","track_id":18,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_roadamerica/18-roadamerica-full/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}