{"coordinates":"-33.4394191,149.5557112","detail_copy":"<p>One of the world's legendary motor racing circuits, Australia's Mt Panorama (aka Bathurst) is a throwback to an era when most motorsports events were staged on public roads. Located outside Bathurst, New South Wales, the 4 mile (6.213 km) Mt Panorama circuit serves as public roadways when not being utilized for racing; indeed many adjacent business and residential properties can only be accessed using the roads comprising the circuit.</p> <p>The circuit embodies many of the characteristics of history's great open road courses, including steep grades and substantial elevation changes (there is a 570 ft/174 meter vertical difference between its high and low points), flowing sequences of challenging, distinctively-named bends like Hell Corner, The Dipper and Forrest's Elbow, and dramatic vistas for spectators.</p> <p>Mt. Panorama was originally carved out of the hills around Bathurst in the 1930s. Through a national employment relief effort during The Depression, local and federal government developed what had been a dirt-track/tourist drive into a race track. Mt Panorama's first event was staged on April, 1938 and – apart from the years during World War II – the circuit has been in regular use ever since. Historically, the racetrack has been used for a wide variety of racing categories, including everything from open-wheel racers to motorcycles. In recent years Mt Panorama has been best known as home of the Bathurst 12 Hour sports car race in February and October's Bathurst 1000, a signature event in the V8 Supercar Series.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/mountpanoramacircuit","gallery_images":"1,2,3","gallery_prefix":"mountpanoramacircuit-gallery","large_image":"mountpanoramacircuit-large.jpg","logo":"/img/logos/tracks/mountpanoramacircuit-logo.png","north":"90deg","num_svg_images":7,"small_image":"mountpanoramacircuit-small.jpg","track_id":219,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_bathurst/219-bathurst/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}