{"coordinates":"33.5318079,-86.6211086","detail_copy":"<p>Modern road-racing circuits don't come any better than Barber Motorsports Park. Built by local dairy magnate George Barber adjacent to his world-class motorsports museum, Barber Motorsports Park includes a total of three track configurations. The track opened in 2003 and in addition to motorcycle races, is host to the Grand-Am Rolex Sports Car Series&#8482;, SCCA club racing weekends and vintage and historic events. Located in a heavily wooded area near Birmingham, Alabama, the Alan Wilson-designed 2.3-mile, 16-turn, sinuous circuit is the epitome of the modern dedicated road-racing facility.</p> <p>Like other Wilson-designed circuits, each of the three track configurations requires a very technical driving style to achieve a good lap time. All of the racing surface is a generous 45 feet wide, which helps provide good passing opportunities, while the 80 feet of total elevation change adds to a driver's challenge and enjoyment by providing blind apexes to a couple of the turns. </p> <p>The beauty of Barber Motorsports Park doesn't end at the edge of the pavement; whimsical large-scale sculptures grace the beautifully landscaped facility, ranging from a pride of lions, Sisyphus pushing a large boulder, ants, birds and dragonflies to the track's hallmark, a giant steel spider outside Turn 5.</p> <p>Directly adjacent to the circuit is the Barber Vintage Motorsport Museum, where you can almost make out the cars and motorcycles inside.</p>","detail_techspecs_copy":null,"detail_video":null,"folder":"/img/tracks/barbermotorsportspark","gallery_images":"1,2,3","gallery_prefix":"barbermotorsportspark-gallery","large_image":"barbermotorsportspark-large.jpg","logo":"/img/logos/tracks/barbermotorsportspark-logo.png","north":"90deg","num_svg_images":8,"small_image":"barbermotorsportspark-small.jpg","track_id":100,"track_map":"https://members-assets.iracing.com/public/track-maps/tracks_barber/100-barber-shortb/","track_map_layers":{"background":"background.svg","inactive":"inactive.svg","active":"active.svg","pitroad":"pitroad.svg","start-finish":"start-finish.svg","turns":"turns.svg"}}